[{"Name":"Adkins Historic and Museum Complex, Inc.","Category":"Historic Site/Heritage Tourism","StreetAddress1":"106 Bratton Street","City":"Mardela Springs","County":"Wicomico","State":"MD","Zip":"21837","location":"38.461780, -75.755177","Description":"","DescriptionLong":"The Adkins Historical and Museum Complex, Inc. was created and developed in 1980 by J. Howard and Louise Adkins.  Their dedication to \"preserving the past\" allow us to turn back time more than a century and get a glimpse into life in the village of Barren Creek Springs. Includes gravestones of Revolutionary War soldier and his wife.</p><p> </p><p>Buildings on the property include: Brattan-Taylor Country Store  The Bratten-Taylor Village Store was built in 1838 on Main Street in Mardela  Springs.  In 2000 the building was moved to Complex grounds.  The store houses many interesting artifacts.  It is also a research center housing the vast collection of research done by Mr. & Mrs. Adkins on local families and the surrounding area. </p><p></p><p>English-Gravenor One Room School  One Room School house was built by Thomas Gravenor in 1857, exhibits the life of a student who attended a one-room school house.</p><p> </p><p>Young's Purchase Farmhouse The Farmhouse was built ca1724 by William Young on a land grant given to William Young known as \"Young's Purchase\"  It was moved to its present location in 1983 and is still sitting on the land grant \"Young's Purchase.\"  The house has been restored and furnished as a colonial farm house. </p><p></p><p>Doctor's Office The Doctor's Office replicates the office of Dr. Lemuel R. Brattan, an area native.  An interesting daybook gives an accout of his caring for the sick from 1854 to 1857. </p><p></p><p>Memorial Building The Memorial Building honors those who served to secure and preserve our liberty.  There are military items from Civil War, World War I, World War II, and the Korean Conflict on display. </p><p></p><p>Cannery WarehouseThe Cannery Warehouse served as a warehouse for a local cannery from 1903-1936.  Restoration of this building was completed in 1991.  In 2009 new exhibits devoted to farming and businesses depicting life of a by gone era in Mardela Springs were opened to the public. </p><p></p><p>Livery Stable The Livery Stable was reopened on Dec 4, 2011 with a new exhibit of a Sharptown Shad Barg a gift from Albert Griffith and restored by James Goslee and friends.  The exhibit also has fishing and hunting apparatus.</p><p> </p><p>In Mardela Springs, the Adkins Historical Museum & Complex offers visitors a tour of 8 historic buildings and the gravestones of a revolutionary war patriot and his wife. Visitors can explore over 800 mid-19th century artifacts on display in the Brattan-Taylor Village Store or one of the rotating exhibits housed in the Odd Fellows Lodge Hall.</p><p></p><p>Also on site is a livery stable circa 1905, two small contractors sheds, the Gravenor-English one room school house and the Youngs Purchase Farmhouse built in 1724. The largest building on the complex, served as a warehouse for a local cannery during the early 20th century. Visitors are able to tour the warehouse, which was restored in 1991 and now houses a unique collection of antique furniture and rare books. The first floor of the warehouse hosts Barren Creek Clocks, a unique manufacturer of wooden geared clocks.  ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://adkinsmuseum.com/\nhttp://www.wicomicotourism.org/explore/historic-sites.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/adkinsHistorical.jpg","Data Source":"http://adkinsmuseum.com/","id":0,"uri":"Adkins%20Historic%20and%20Museum%20Complex%2C%20Inc.","photos":["http://apps.esrgc.org/scenicbyway/img/adkinsHistorical.jpg"],"websites":["http://adkinsmuseum.com/","http://www.wicomicotourism.org/explore/historic-sites.html"]},{"Name":"Adkins Mill Park, Trails and Public Water Access","Category":"Recreational/Hiking and Biking Trails/Public Water Access","StreetAddress1":"5168 Powellville Road","City":"Powellville","County":"Wicomico","State":"MD","Zip":"21852","location":"38.3319870, -75.373154","Description":"","DescriptionLong":"•  Boating - Motorized Access</p><p>•  Boating - Non-Motorized Access</p><p>•  Kayak/Canoe Put-In</p><p></p><p>Adkins Mill Park is quietly nestled along Adkins Pond in the town of Powellville, Maryland. Upon entering the 34 acre picturesque park, visitors will find a large pavilion with picnic tables and a grill, permanent restroom facilities and a shaded fishing pier. The pier extends out into the four acre pond which supports a standard bass/bluegill fishery managed accordingly by the Department of Natural Resources.    Additionally, Adkins Mill Park has a .5 mile scenic nature trail which can be found by following the road past the fishing pier and around the bend. At the entrance to the trail, is a beautiful butterfly garden with a bench and stepping stones, created by the Powellville 4-H Clubs as a community service project in 2007. This peaceful and secluded park is a perfect place to bring the family for a picnic by the water or to spend a few hours fishing and hiking.  37 acres. </p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/adkins-mill-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Adkins Mill Park 1.jpg","Data Source":"","id":1,"uri":"Adkins%20Mill%20Park%2C%20Trails%20and%20Public%20Water%20Access","photos":["http://apps.esrgc.org/scenicbyway/img/Adkins Mill Park 1.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/adkins-mill-park.html"]},{"Name":"Alfred C. Dykes Building (Kuhns’ Jewelry Building)","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"Downtown Plaza","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.365597, -75.600966","Description":"","DescriptionLong":"This distinctively styled building is known as the Kuhns' Jewelry,”The 6th oldest continuously operated jewerlry business in the nation. Established in 1853.\" The business transferred to different jewelers; the business was bought by John A. Kuhn in 1923 and renamed. The longtime business occupied other buildings prior to being established here. The building is named for Alfred C Dykes, the owner who built the structure following the 1886 fire.  The building passed through different owners before purchased by the Kuhn family in 1974. This is listed in the MD Inventory of Historic Properties.","DateOfSite":"Built in 1892","NationalRegister":"","MD Inventory":"WI-147","In Historic District":"","MD Military Monuments":"","Website":"http://www.kuhnsjewelers.com/pages/brief-history","Website addl":"","Additional Information":"**At the Crossroads","Photo":"http://apps.esrgc.org/scenicbyway/img/lfred C Dykes Bldg_Kuhns Bldg 2.JPG","Data Source":"","id":2,"uri":"Alfred%20C.%20Dykes%20Building%20(Kuhns%E2%80%99%20Jewelry%20Building)","photos":["http://apps.esrgc.org/scenicbyway/img/lfred C Dykes Bldg_Kuhns Bldg 2.JPG"],"websites":["http://www.kuhnsjewelers.com/pages/brief-history"]},{"Name":"Arthur W Perdue Stadium ","Category":"Points of Interest/Sports","StreetAddress1":"6400 Hobbs Road","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21804","location":"38.369851, -75.529915","Description":"","DescriptionLong":"Delmarva Shorebirds are the Class \"A\" Minor League Baseball affiliate of the Baltimore Orioles. Located in Salisbury, MD, the team calls Arthur W. Perdue Stadium it's home. The team first opened it's gates in April of 1996, beginning as a Montreal Expos affiliate, a relationship that lasted just a single season as a deal was struck to make the Shorebirds an affiliate of the Orioles Organization inA member of the South Atlantic League, the team plays 140 games each season, 70 at home and 70 on the road, all of which are broadcast on Fox Sports 960 AM. The organization is owned and operated by 7th Inning Stretch LP, which also owns the Stockton Ports and Everett Aquasox, both of which are located on the West Coast.    Since 1996 the 'Birds have been crowned champions twice, the first coming in 1997 and the latest in the year 2000. Some memorable Shorebirds who have gone on to play in the big leagues are players like Manny Machado, Erik Bedard, Brian Roberts, Nick Markakis, John Maine, Orlando Cabrera and Javier Vasquez among others. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.milb.com/index.jsp?sid=t548","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":3,"uri":"Arthur%20W%20Perdue%20Stadium%20","photos":[],"websites":["http://www.milb.com/index.jsp?sid=t548"]},{"Name":"Asbury Methodist Church","Category":"Historic Site","StreetAddress1":"26679 Collins Wharf Rd.","City":"Allen","County":"Wicomico","State":"MD","Zip":"21810","location":"38.290278, -75.690556","Description":"","DescriptionLong":"A historic church located at Allen, Wicomico County, Maryland. It is a rectangular, gable-front frame structure, with the entrance located in a square bell tower centered on the front. The main block of the building was constructed in 1848 and the tower was added in 1883. It was listed on the National Register of Historic Places in 1999.","DateOfSite":"","NationalRegister":"1999","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://en.wikipedia.org/wiki/Asbury_Methodist_Episcopal_Church_%28Allen,_Maryland%29","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Asbury Methodist Allen 1.jpg","Data Source":"","id":4,"uri":"Asbury%20Methodist%20Church","photos":["http://apps.esrgc.org/scenicbyway/img/Asbury Methodist Allen 1.jpg"],"websites":["http://en.wikipedia.org/wiki/Asbury_Methodist_Episcopal_Church_%28Allen,_Maryland%29"]},{"Name":"B.L. Gillis & Son Store Building (Feldman Building)","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"150 Market Street","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.364701, -75.603316","Description":"","DescriptionLong":"This 3-story building, best remembered as the Feldman Furniture store, was occupied for many years as a 2-story structure owned by B.L. Gillis & Son, wholesale grocers. In 1890, Allison A. Gillis purchased the lot from S. Frank Toadvine. In 1923 the property was transferred to Samuel S. and William Feldman who developed the Feldman's Brothers furniture business that they began in 1906. The building was remodeled around 1925 expanding to a 3-story building. The building is listed in the Maryland Inventory of Historic Properties (No. WI-274).","DateOfSite":"c.1890, 1925","NationalRegister":"","MD Inventory":"WI-274","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/B L Gillis Feldman Bldg 1.JPG\nhttp://apps.esrgc.org/scenicbyway/img/B L Gillis Feldman Bldg 2.jpg","Data Source":"MD Inventory of Historic Properties\n1908 Wicomico News special edition photo","id":5,"uri":"B.L.%20Gillis%20%26%20Son%20Store%20Building%20(Feldman%20Building)","photos":["http://apps.esrgc.org/scenicbyway/img/B L Gillis Feldman Bldg 1.JPG","http://apps.esrgc.org/scenicbyway/img/B L Gillis Feldman Bldg 2.jpg"],"websites":[]},{"Name":"Barren Creek Springs Heritage Center and Museum","Category":"Points of Interest/Historic Site/Museum","StreetAddress1":"413 Main Street","City":"Mardela Springs","County":"Wicomico","State":"MD","Zip":"21837","location":"38.460270, -75.759142","Description":"","DescriptionLong":"In the Barren Creek Heritage Museum, more than thirty permanent exhibits tell the story of the Barren Creek area & the town of Mardela Springs from 1660s to ca. 1950, and highlight specific aspects of life in the local area. Visitors entering the Museum step into a large exhibit gallery, and stroll through 300 years of the area's history. Puckamee (Nanticoke) Indians, tobacco planters who shipped their crop from the Barren Creek warehouse, grist millers and sawyers & farmers, enterprising shipbuilders & seamen & merchants, hotel keepers and spa operators & distributors of mineral water, free black pioneers and spiritual leaders --- these were the brave and daring ancestors who created a life along the banks of the Nanticoke River and the creeks feeding into it. These exhibits reveal their tenacity, their ingenuity, and their faith as they grew and prospered. Their story unfolds in pictures, maps, and bits and pieces of our tangible past.                  The Museum seeks to collect those historical artifacts and papers which clearly reflect the social, cultural, economic, and political heritage of the area around Mardela Springs and western Wicomico County from the 1600s through the early to mid-1900s. In addition, the Center accepts those objects which also reflect the heritage of the Lower Eastern Shore of Maryland and lower Delaware, and the Chesapeake Tidewater, primarily in the 19th and early 20th centuries. Items will be accepted only as outright donations; no items will be accepted on long-term loan basis.</p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.barrencreekheritage.org\nhttp://www.museumsusa.org/museums/info/18951","Website addl":"http://www.museumsusa.org/museums/info/18951","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/barrenCreekMuseum.jpg","Data Source":"","id":6,"uri":"Barren%20Creek%20Springs%20Heritage%20Center%20and%20Museum","photos":["http://apps.esrgc.org/scenicbyway/img/barrenCreekMuseum.jpg"],"websites":["http://www.barrencreekheritage.org","http://www.museumsusa.org/museums/info/18951"]},{"Name":"Billy Gene Jackson Sr Park","Category":"Recreational ","StreetAddress1":"420 North Lake Park Drive","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.3755166861634, -75.6041383883911","Description":"","DescriptionLong":"Billy Gene Jackson Sr. Park is located alongside the Salvation Army’s Richard Hazel Youth Center on North Lake Park Drive. The pairing of the two sites is appropriate as Mr. Jackson, whom the park is named after, is well known for inspiring at-risk children. The park consists of a lighted softball field, lighted basketball courts with bleachers, lighted tennis courts, a playground area, and a permanent concessions building with a covered picnic area and restroom facilities. Additionally, if you follow the road around the softball field, you will find that the park has a walking trail leading to a small beach area with a fishing pier on Johnson Pond. A variety of youth programs are offered at the park in a cooperative effort between the Wicomico County Department of Recreation, the Salisbury Advisory Council on Youth Activities (SACYA), and the Salvation Army. During the summer, for instance, sports lessons are provided in the mornings and a youth basketball league is held in the evenings on the lighted courts. Additionally, the park is one of the county’s Summer Playground Program evening sites, providing free activities for children ages 5 and up starting in June each year. Like its namesake, Billy Gene Jackson Sr. Park is an incredible resource for the local community.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/billy-gene-jackson-sr-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Billy Gene Jackson Sr. Park 1.jpg","Data Source":"","id":7,"uri":"Billy%20Gene%20Jackson%20Sr%20Park","photos":["http://apps.esrgc.org/scenicbyway/img/Billy Gene Jackson Sr. Park 1.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/billy-gene-jackson-sr-park.html"]},{"Name":"Boulevard Theater Site","Category":"Historic Site","StreetAddress1":"317 East Main Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.365956, -75.596035","Description":"","DescriptionLong":"This is the site of the Boulevard Theater. The large movie theater, which opened on June 27, 1947, was designed by Newell Howard and Raymond Todd of the Ulman Theater Corp.  The Ulman family of Salisbury had a history of operating theaters, beginning with the Ulman Opera House on Main Street near Market Street, which was rebuilt as a movie theater. The Boulevard was the last surviving theater in downtown and the longest in operation. It closed in 2000 and later torn down.","DateOfSite":"1946-47","NationalRegister":"","MD Inventory":"WI-582","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Boulevard Theater Site 1.jpg","Data Source":"MD Inventory of Historic Properties","id":8,"uri":"Boulevard%20Theater%20Site","photos":["http://apps.esrgc.org/scenicbyway/img/Boulevard Theater Site 1.jpg"],"websites":[]},{"Name":"Brewington Building","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"229 Main Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.365416, -75.602807","Description":"","DescriptionLong":"Historically known as the Brewington Building or the Goodman Department Store, the structure was built around 1905-10. In 1892, Edwina C. Brewington purchesd this lot from John White, but the lot remained vacant until the building was constructed. In 1908, Edwina and her husband Henry S. Brewington leased the property to Moses Fine and Henry D. Kurtz. During the mid 20th century the building housed the Goodman Department Store. The building is listed in the Maryland Inventory of Historic Properties (No. WI-149).","DateOfSite":"c.1905-10","NationalRegister":"","MD Inventory":"WI-149","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Brewington Bldg 1.JPG","Data Source":"MD Inventory of Historic Properties","id":9,"uri":"Brewington%20Building","photos":["http://apps.esrgc.org/scenicbyway/img/Brewington Bldg 1.JPG"],"websites":[]},{"Name":"Brick Row Houses","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"669-683 Fitzwater Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.364113, -75.610132","Description":"The two-story brick rowhouse on Fitzwater Street in Salisbury was built in 1911 as housing for the growing ship building industry in Salisbury.","DescriptionLong":"The two-story brick rowhouse block, referred to as “Brick Row” located on Fitzwater Street at the intersection with Hill Street on the west side of Salisbury, dates to 1911. The stretcher bod brick façade is marked by series of segmental arched door and window openings, and the first floor was originally sheltered by a sheet roof porch, part of which survives. The building originated by the partnership of William C. Powell, John W. Windsor, and Glen Perdue. John W. Windsor’s name and the date 1911 are inscribed in a marble date stone above the door of the northeast corner unit which once operated as a store. </p><p></p><p>Winder and Powell were contractors, and Glen Perdue was the proprietor of the Peninsula Brick Company. The three formed to construct worker housing, as twenty-five skilled boat builders from Sharptown and other areas were hired to work at the newly established and growing Salisbury Marine Construction Company. Powell traveled to Philadelphia and looked at example housing to influence the design of the Fitzwater Street housing. Windsor was to do the carpenter work; Powell, the brick work, and Perdue to furnish building supplies. </p><p>","DateOfSite":"1911","NationalRegister":"","MD Inventory":"WI-451","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/brickRow.jpg","Data Source":"1.        Maryland Historical Trust State Historic Sites Inventory Form, Paul B. Touart, Architectural Historian, June 29, 1999\n2.        The Courier, Salisbury, Maryland, Mar. 25, 1911, Peg Lauridsen Collection of the Nabb Research Center, Salisbury University\n","id":10,"uri":"Brick%20Row%20Houses","photos":["http://apps.esrgc.org/scenicbyway/img/brickRow.jpg"],"websites":[]},{"Name":"Bridge at City Park","Category":"Recreational/Historic Site/Maryland Historical Trust","StreetAddress1":"City Park East Main St & Snow Hill Road & Park Drive","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.36503742611397,-75.59235602617264","Description":"","DescriptionLong":"Arched footbridge, built in early 1930’s, is a signature landmark within the City Park(Municipal Park) to visitors old and new.  It is a graceful arch supported upon 4 iron trusses. The bridge was built in a larger effort to improve the park land following the devastating 1933 storm that cause the Schumaker Mill dam to giveway upstream and washed out the early park improvements. The park originally came about due to a dam failure of the Humphreys Mill dam in 1909. It was built in conjunction with CityPark bandstand.  ","DateOfSite":"1935","NationalRegister":"","MD Inventory":"WI-581","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/citybridge.jpg","Data Source":"MHT MD Inventory of Historic Properties","id":11,"uri":"Bridge%20at%20City%20Park","photos":["http://apps.esrgc.org/scenicbyway/img/citybridge.jpg"],"websites":[]},{"Name":"Byrd Tavern and Slave Pens (prior to Courthouse)","Category":"Historic Marker/Historic Site","StreetAddress1":"Corner of Division and Main Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.36581666666667, -75.60046666666666","Description":"","DescriptionLong":"Site was once famous hostelry in stage coach days. Operated by John Byrd. Bryd was killed by a Union soldier during the war.  The Tavern  was busy community center where planters would barter merchandise and buy slaves. In the basement and at the rear were slave pens. Building was a low rambling frame structure with dormer windows and double tier porch extending across the whole length of the front.*","DateOfSite":"","NationalRegister":"A marker  on the ground of the site identifies Byrd Tavern in the Daughters of the American Revolution Marker series","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"https://aahistorydelmarva.wordpress.com/2013/12/02/salisburys-slave-pens/ ","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Byrd Tavern and Slave Pens 1.JPG","Data Source":"","id":12,"uri":"Byrd%20Tavern%20and%20Slave%20Pens%20(prior%20to%20Courthouse)","photos":["http://apps.esrgc.org/scenicbyway/img/Byrd Tavern and Slave Pens 1.JPG"],"websites":["https://aahistorydelmarva.wordpress.com/2013/12/02/salisburys-slave-pens/ "]},{"Name":"Cedar Hills Trails Marina & Park","Category":"Recreational/Hiking and Biking Trails","StreetAddress1":"20945 Harbor View Road","City":"Bivalve","County":"Wicomico","State":"MD","Zip":"21814","location":"38.310851, -75.887099","Description":"","DescriptionLong":"85 acres. Cedar Hill Marina and Park is truly a hidden gem of Wicomico County, Maryland. Located in the town of Bivalve, Maryland along the Nanticoke River, the park is about 15 scenic miles from Salisbury via Nanticoke Road.  Walking, nature trails. The marina boasts 140 boat slips, additional transient slips, a dual concrete boat ramp for easy launching, and a pump-out station.</p><p></p><p>The marina is surrounded by the peaceful and secluded park area. There is a pavilion and floating dock by the water’s edge, perfect for fishing or crabbing in the summer, and a small beach area with a gorgeous view of the river. Next to the marina is the wooded section of the park, providing much welcomed shade in the summertime. Here visitors will find the public restroom facilities, another large pavilion with picnic tables and grills, a playground area, and a walking trail. The playground includes two swing sets, a spinning merry-go-round, and a play set with slides and climbing equipment. On the other side of the marina, visitors will find tennis courts, a basketball court and a recreational soccer and softball field. The new Curtis Insley Annex, visible from Nanticoke Road at the second entrance to the park, provides new soccer and softball fields which are home to the Bivalve sports teams.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/cedar-hill-park-and-marina.html\nhttp://www.cedarhillmarina.com/","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Cedar Hills Trail 1.jpg","Data Source":"","id":13,"uri":"Cedar%20Hills%20Trails%20Marina%20%26%20Park","photos":["http://apps.esrgc.org/scenicbyway/img/Cedar Hills Trail 1.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/cedar-hill-park-and-marina.html","http://www.cedarhillmarina.com/"]},{"Name":"Cedarhurst Playground","Category":"Recreational","StreetAddress1":"Rockawalkin Ridge Road","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.3986025, -75.6438883","Description":"","DescriptionLong":"(5.8 acres park) Seemingly tucked away on Rockawalkin Ridge Road, Cedarhurst Playground is actually very close to Route 50 (just a few blocks) and also easily accessible from the Nanticoke Road and Hebron areas. The spacious and well shaded neighborhood park has a playground area that includes a play set with slides and climbing equipment, two swing sets and a merry-go-round. There are several picnic tables and a grill on the far end of the park, perfect for a family Bar-Be-Que. Additionally, the park boasts a nice basketball court and a recreational softball field, great for pick-up games or a round of home run derby. Overall, Cedarhurst Playground is a great place to bring the family for a few hours of outdoor fun. - See more at: http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/cedarhurst-playground.html#sthash.8Rql34mF.dpuf","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/cedarhurst-playground.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Cedarhurst Playground 1.jpg","Data Source":"","id":14,"uri":"Cedarhurst%20Playground","photos":["http://apps.esrgc.org/scenicbyway/img/Cedarhurst Playground 1.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/cedarhurst-playground.html"]},{"Name":"Centennial Village Playground","Category":"Recreational","StreetAddress1":"6373 Freedom Way","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.368595, -75.664766","Description":"","DescriptionLong":"(3.0 acres park) Centennial Village Playground is located just off Nanticoke Road inside the Centennial Village neighborhood. It is a quiet, nicely shaded park with tennis courts, a basketball court, a multi-use field, and a playground area. The playground includes two swing sets (including baby swings), a large sandbox, and a play set designed for children ages 5-12. The park also has a picnic table, several benches, and a bike rack.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/centennial-village-playground.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Centennial Village Playground 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Centennial Village Playground 2.jpg","Data Source":"","id":15,"uri":"Centennial%20Village%20Playground","photos":["http://apps.esrgc.org/scenicbyway/img/Centennial Village Playground 1.jpg","http://apps.esrgc.org/scenicbyway/img/Centennial Village Playground 2.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/centennial-village-playground.html"]},{"Name":"Charles Chipman Cultural Center ","Category":"Historic Site","StreetAddress1":"325 Broad Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.368243, -75.596493","Description":"","DescriptionLong":"The Chipman Cultural Center is an historic landmark, a former African American church dating to 1837 when five local freedmen purchased property and built a structure for use as a church, school and meeting place. Formerly known as the John Wesley Methodist Episcopal Church, the building is now a cultural center and small museum honoring the history of African Americans of the Eastern Shore regional area.        Built in 1838, the Chipman Center is the oldest standing African-American church on Delmarva.   It occupies the site of a former open meadow where slaves gathered for worship. A plain one-story structure was built in 1838 for religious services and a day school. The church was identified as the African Methodist Church and informally known as the \"Hill Church\" or \"Church on the Hill.\" The building was eventually expanded, and incorporated in 1876. Eventually the property was abandoned as a church, but educators Charles and Jeanette Chipman purchased the property and deeded it to the Newtown Association.</p><p></p><p>The Rev. Frost Pollitt (born October 1789, manumitted April 12, 1828, recommended as Deacon to Philadelphia Conference of the Methodist Episcopal Church, Princess Ann, Maryland, February 8, 1851, died March 12, 1872) was a former slave, and an itinerant Black Methodist Episcopal preacher in Somerset County & Worcester Counties, Maryland from 1828 to 1864, as well as Delaware, Virginia, Pennsylvania and Washington, D.C., and later a Founding member and Presiding Elder of the Delaware Conference of the Methodist Episcopal Church, starting in 1864, and the first pastor of the African Church abt. 1837, later to be the John Wesley M.E. Church in Salisbury, Maryland, now the Charles H. Chipman Cultural Center. Frost was born a slave most likely on a Worcester County, Maryland plantation owned by William Pollitt.</p><p>","DateOfSite":"1837","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.cchipmanculturalctr.org/#!history/c8de  \nhttp://frostpollitt.org ","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/charlesChipmanCenter.jpg","Data Source":"","id":16,"uri":"Charles%20Chipman%20Cultural%20Center%20","photos":["http://apps.esrgc.org/scenicbyway/img/charlesChipmanCenter.jpg"],"websites":["http://www.cchipmanculturalctr.org/#!history/c8de  ","http://frostpollitt.org "]},{"Name":"Cherry Beach Park and Public Water Access","Category":"Recreational/Public Water Access","StreetAddress1":"110 Cherry Beach Road","City":"Sharptown","County":"Wicomico","State":"MD","Zip":"21867","location":"38.5440851, -75.7179922","Description":"","DescriptionLong":"•  Boating - Motorized Access</p><p>•  Boating - Non-Motorized Access</p><p>•  Kayak/Canoe Put-In</p><p></p><p>5 acres.  Cherry Beach Park is located along the upper Nanticoke River in Sharptown, about 15 minutes from Salisbury. This beautiful piece of land was originally given to the town by A.W. and Ida Robinson to be used solely for public recreation. Today, the heavily used recreation facility provides Sharptown and greater Wicomico County residents with a boat ramp, a fishing pier, a large pavilion with picnic tables and a beach area.  Updated in 2009 as part of the park’s Master Plan, Cherry Beach also now has an expanded parking lot, a new Gametime Playground for school age children, a revitalized beach and shoreline, and a walking path connecting it to neighboring Cope Bennett Park. Funding for these upgrades was provided by Maryland Program Open Space, the Maryland Waterway Improvement Fund, and local grant matches.</p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/cherry-beach-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Cherry Beach Park 1.jpg","Data Source":"","id":17,"uri":"Cherry%20Beach%20Park%20and%20Public%20Water%20Access","photos":["http://apps.esrgc.org/scenicbyway/img/Cherry Beach Park 1.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/cherry-beach-park.html"]},{"Name":"Cherrybridge Creek Public Water Access","Category":"Recreational/Public Water Access","StreetAddress1":"","City":"","County":"Wicomico","State":"MD","Zip":"","location":"38.314861, -75.770176","Description":"","DescriptionLong":"Kayaking - Put in at the bridge just after Green Hill Creek, directly off of Whitehaven Road and paddle downstream through marshland and forested bluffs and pull out in the town of Whitehaven (3 hrs).</p><p></p><p>Parking: Not much of a shoulder to park on, would be best to get dropped off at bridge and picked up in Whitehaven","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicoriver.org/cherrybridge-creek.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":18,"uri":"Cherrybridge%20Creek%20Public%20Water%20Access","photos":[],"websites":["http://www.wicomicoriver.org/cherrybridge-creek.html"]},{"Name":"Chesapeake East","Category":"Heritage Tourism","StreetAddress1":"501 West Main Street ","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.365292, -75.605360","Description":"","DescriptionLong":"Local arts and gift shop by nationally known artists Dana Simpson and John Orth.   A do it yourself pottery shop is also offered. Upstairs offers rentalble space. Free parking in the back.  This couple was responsible for rehabilitation of this building which was known as the  Franklin Hotel","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"www.chesapeakeeast.com","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":19,"uri":"Chesapeake%20East","photos":[],"websites":["www.chesapeakeeast.com"]},{"Name":"Chesapeake Shipbuilding","Category":"Historic Site","StreetAddress1":"710 Fitzwater Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"","location":" 38.363018,-75.612753","Description":"Site of the former Roberts Shipyard and formerly Otis Lloyd Shipbuilding","DescriptionLong":"Chesapeake Shipbuilding carries on the tradition of shipbuilding in Salisbury. Between the late 1800s and 1989,the Chesapeake Shipbuilding  site was used for the production of new steel ships and for the  maintenance and repair of wooden vessels. The Spruce Tree Corporation (STC) purchased the site in 1982. The site is located on the northwestern shore of the Wicomico River, a tidal arm of the Chesapeake Bay estuary, in a mixed residential, commercial and industrial area. Municipal well water systems or private wells serve the surrounding population. In addition, the site’s southern border is the Wicomico River, a Class II recreational waterway. At about 1901, Capt. Otis Lloyd, Sr. purchased from A.F. Parsons a shipbuilding plant close to the current Chesapeake Shipbuilding, and expanded the business, named the Salisbury Marine Railway Company.  Lloyd had moved from Whitehaven where he had been engaged in shipbuilding. In about 1907, Lloyd partnered with James Williams, further expanding the business. Lloyd later sold his interest in the plant and went into the pile driving business for building bridges and foundations. </p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://chesapeakeshipbuilding.com/index.html \nhttp://fredrobertsocala.com/fred-n-roberts-sr/\nhttp://archive.delmarvanow.com/article/20081214/LIFESTYLE/812140315/Shipyard-s-history-fuzzy-its-impact-clear\nhttp://www.shipbuildinghistory.com/history/shipyards/5small/active/chesapeake.htm\n","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Chesapeake Shipbuilding 1.JPG\nhttp://apps.esrgc.org/scenicbyway/img/chesapeakeShipbuilding.jpg","Data Source":"Websites; 1908 Wicomico News special business edition","id":20,"uri":"Chesapeake%20Shipbuilding","photos":["http://apps.esrgc.org/scenicbyway/img/Chesapeake Shipbuilding 1.JPG","http://apps.esrgc.org/scenicbyway/img/chesapeakeShipbuilding.jpg"],"websites":["http://chesapeakeshipbuilding.com/index.html ","http://fredrobertsocala.com/fred-n-roberts-sr/","http://archive.delmarvanow.com/article/20081214/LIFESTYLE/812140315/Shipyard-s-history-fuzzy-its-impact-clear","http://www.shipbuildinghistory.com/history/shipyards/5small/active/chesapeake.htm"]},{"Name":"City Park","Category":"Maryland Historical Trust/Recreational","StreetAddress1":"E Main St, Snow Hill Rd, N Park Drive, S Park Drive, Beaglin Park Drive","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.362353889791386,-75.58568000793457","Description":"","DescriptionLong":"Park encompasses over 95 acres and includes the Salisbury Zoological Park. Free and open to the public visitors enjoy trails, playgrounds, river walk running throughout.","DateOfSite":"Aprox 1930","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/citypark.jpg","Data Source":"","id":21,"uri":"City%20Park","photos":["http://apps.esrgc.org/scenicbyway/img/citypark.jpg"],"websites":[]},{"Name":"City Park Fountain","Category":"Historic Site/Recreational/Maryland Historical Trust","StreetAddress1":"Salisbury City Park","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21804","location":"38.364934376791126, -75.589719414711","Description":"","DescriptionLong":"The electric water fountain was built prior to the Salisbury Bicentennial in 1932.* The area that encompasses the Salisbury City Park was once covered by Humphrey’s Lake. The City Park owes its existence to the failure of the Humphrey’s Lake mill dam on May 29, 1909. After the lake was drained, the area east of the railroad bridge was an abandoned wasteland. In 1925, Salisbury Mayor Thomas L Parker Sr. negotiated the purchase of the 53 acre exposed lake bottom for $5000, in order to construct a new municipal water plant and well field.  Since the new water system only took up a small portion of the lake bottom, the balance of the land was developed as the municipal park. In 1927, Mayor Parker appointed the first Park Commission to oversee the park.</p><p>Winding through the early park was the east prong of the Wicomico River, spanned by a series of simple timber footbridges. The devastating Atlantic storm of August 1933 damaged the Schumaker Lake dam, flooding the park and destroying most of the improvements.  In the years following this storm, with aid from Depression Era federal work programs such as the WPA, the park lands were redesigned and improved with trees, shrubs, bridges, roads and walkways. Two of the most distinctive structures built during this time were the octagonal bandstand and the arched footbridge.*</p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.geocaching.com/geocache/GC4B6JF_wgd-2013-salisbury-city-park","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/City Park Fountain 1.JPG","Data Source":"","id":22,"uri":"City%20Park%20Fountain","photos":["http://apps.esrgc.org/scenicbyway/img/City Park Fountain 1.JPG"],"websites":["http://www.geocaching.com/geocache/GC4B6JF_wgd-2013-salisbury-city-park"]},{"Name":"Clara Road Public Water Access","Category":"Recreational/Public Water Access","StreetAddress1":"At the end of Clara Road","City":"Tyaskin","County":"Wicomico","State":"MD","Zip":"21865","location":"38.261998, -75.820372","Description":"","DescriptionLong":"Soft Launch area.</p><p></p><p>Please note that \"large boats\" is intended as a general reference to ramp capacity. Generally, vessels less than 16 feet in length are considered small and those greater than 16 feet as large. Parking is unknown. There is a turnaround.</p><p></p><p>Directions: MD Route 50 towards Ocean City to MD Route 347 (N. Main Street). Left at MD Route 347 (Quantico Road). Right at Nebo Road. Right at MD Route 352 (Whitehaven Road). Right at Route 352 (Capitola Road). Left at Clara Road.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://dnr2.maryland.gov/boating/Pages/water-access/wicomico.aspx","Website addl":"http://dnr2.maryland.gov/boating/Pages/water-access/wicomico.aspx","Additional Information":"","Photo":"","Data Source":"","id":23,"uri":"Clara%20Road%20Public%20Water%20Access","photos":[],"websites":["http://dnr2.maryland.gov/boating/Pages/water-access/wicomico.aspx"]},{"Name":"Colonial Building","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"126 Main Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.365403, -75.599460","Description":"","DescriptionLong":"The Colonial Building, also known as the Hearne & Bailey law office, was constructed about 1927 when the lot was transferred to attorneys Hooper S. Miles, Levin C. Bailey, and S. Franklyn Woodcock. The building is listed in the Maryland Inventory of Historic Properties (No. WI-273).","DateOfSite":"c.1927","NationalRegister":"","MD Inventory":"WI-273","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Colonial Bldg 1.JPG","Data Source":"MD Inventory of Historic Properties","id":24,"uri":"Colonial%20Building","photos":["http://apps.esrgc.org/scenicbyway/img/Colonial Bldg 1.JPG"],"websites":[]},{"Name":"Cope Bennett Park","Category":"Recreational","StreetAddress1":"100 Railway Street","City":"Sharptown","County":"Wicomico","State":"MD","Zip":"21861","location":"38.5418596, -75.71753239","Description":"","DescriptionLong":"(7.5 acres park) Cope Bennett Park is situated along the Nanticoke River in Sharptown, Maryland, about 15 minutes from Salisbury. The spacious park provides a unique view of the Route 313 bridge as it crosses the river dividing Wicomico and Dorchester counties. In addition to the beautiful view, the park provides visitors with two tennis courts, a softball field, a large playground area, a pavilion with picnic tables, and a walking path along the water’s edge. The walking path is a 1,000 foot greenways trail which was added in 2009 as part of the Cope Bennett/Cherry Beach Master Plan. The path now connects the two parks, leading under the bridge to Cherry Beach Park which provides another playground, a small beach area, a large pavilion, and a boat ramp and fishing pier. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/cope-bennett-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Cope Bennett Park 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Cope Bennett Park 2.jpg","Data Source":"","id":25,"uri":"Cope%20Bennett%20Park","photos":["http://apps.esrgc.org/scenicbyway/img/Cope Bennett Park 1.jpg","http://apps.esrgc.org/scenicbyway/img/Cope Bennett Park 2.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/cope-bennett-park.html"]},{"Name":"Costen House","Category":"Historic Site/Heritage Tourism/Museum","StreetAddress1":"206 Market Street","City":"Pocomoke","County":"Worcester","State":"MD","Zip":"21851","location":" 38.074618, -75.567701","Description":"","DescriptionLong":"Dr. Costen was born on October 10, 1832 in Somerset County. Maryland, the son of William and Rosa Taylor Costen. He was educated at Washington Academy in Princess Anne and received his medical degree from Penn Medical College in Philadelphia in 1857.At the time he was elected mayor of Pocomoke City in 1888, Dr. Costen had already served fifteen years on the Democratic State Central Committee. He had been elected to the Maryland State Legislature in 1881, where he served only one term. He was a trustee of Pocomoke High School and an Elder and Trustee of Pitts CreekPresbyterian Church. He served two terms as mayor, 1888-1892 and in 1908 was again elected mayor to serve two more terms. Dr. Costen died at his home on April 1, 1931.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.costenhousemuseum.org/","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Costen House.jpg","Data Source":"","id":26,"uri":"Costen%20House","photos":["http://apps.esrgc.org/scenicbyway/img/Costen House.jpg"],"websites":["http://www.costenhousemuseum.org/"]},{"Name":"Cove Road Beach","Category":"Recreational","StreetAddress1":"Cove Road","City":"Bivalve","County":"Wicomico","State":"MD","Zip":"21814","location":"38.2880144, -75.900002","Description":"","DescriptionLong":"1.6 acres About 15 miles from Salisbury, the Cove is a well-kept secret by those who have discovered it. Why? Because it is the perfect beach spot for kids and sunbathers alike and the quick, scenic drive down Nanticoke Road. The beach area is long and narrow with tall beach grass separating it from the parking lot and shaded picnic tables. From the warm sand, the view of the Nanticoke River is beautiful. The water is calm and shallow, perfect for young children to swim in without the worry of being knocked over by an ocean wave. good fishing and crabbing spot in the quiet of the early morning or evening hours.   Parking lot available. Quite calm waters.  ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/cove-road-beach.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Cove Road Beach 1.jpg","Data Source":"","id":27,"uri":"Cove%20Road%20Beach","photos":["http://apps.esrgc.org/scenicbyway/img/Cove Road Beach 1.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/cove-road-beach.html"]},{"Name":"Crooked Oak Playground","Category":"Recreational","StreetAddress1":"Quercus Drive","City":"Hebron","County":"Wicomico","State":"MD","Zip":"21830","location":"38.375758337831876, -75.67169746032715","Description":"","DescriptionLong":"(2.5 acres park) Crooked Oak Playground is located on Quercus Drive, just off Crooked Oak Lane, making it a convenient neighborhood park for residents of Salisbury’s Westside corridor. The spacious park has a basketball court, a soccer field, tennis courts, swing sets, and several shaded picnic tables and benches. The courts are a great place for a pick-up game with family and friends. Plus, the soccer field is a great spot for neighborhood kids and local teams to kick around. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/crooked-oak-playground.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Crooked Oak Playground 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Crooked Oak Playground 2.jpg","Data Source":"","id":28,"uri":"Crooked%20Oak%20Playground","photos":["http://apps.esrgc.org/scenicbyway/img/Crooked Oak Playground 1.jpg","http://apps.esrgc.org/scenicbyway/img/Crooked Oak Playground 2.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/crooked-oak-playground.html"]},{"Name":"Delmarva Discovery Center & Museum","Category":"Museum/Heritage Tourism","StreetAddress1":"2 Market Street","City":"Pocomoke","County":"Worcester","State":"MD","Zip":"21851","location":"38.076044, -75.570162","Description":"","DescriptionLong":"The Delmarva Discovery Center & Museum on the Pocomoke River serves as a source of learning and discovery for the public through the preservation and interpretation of its cultural and natural heritage. </p><p></p><p>Located on the Pocomoke River in downtown Pocomoke City, the Delmarva Discovery Center & Museum (DDC) is a living museum, a place for learning and discovery for visitors of all ages. The immersive and engaging exhibits take visitors on a timeless journey through Delmarva and through the Cypress Swamp. The exhibits focus on the river ecology and the human history of the Pocomoke River and Delmarva. The DDC continues to add to its unique collection, offering return visitors something new to discover each time they visit. The DDC offers a regular schedule of programs, tours, and presentations to families, school classes, youth groups, and other visitors.</p><p></p><p>The DDC is a 16,000 square foot, 1920's era building and houses the exhibits, a Museum Store, classroom, and administrative space. Visitors can extend their visit to Pocomoke by strolling through Cypress Park or walking through the Cypress Swamp on the Discovery Nature Trail. Also, within walking distance are the Sturgis One Room School House, The historic Mar-Va Theatre and the Costen House.</p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://delmarvadiscoverycenter.com/about.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":29,"uri":"Delmarva%20Discovery%20Center%20%26%20Museum","photos":[],"websites":["http://delmarvadiscoverycenter.com/about.html"]},{"Name":"Dorman & Smyth Hardware Co. Building","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"232-234 Main Street","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.36518, -75.602933","Description":"","DescriptionLong":"The Dorman & Smyth Hardware Company Building was one of the first Main Street structures erected following the 1886 fire. Construction is credited to the Jackson family who owned the parcel at the time of the fire. Four months after the fire, E.E. Jackson and other family members transferred the new building and lot to William H. Jackson. The property was leased to the Dorman & Smyth Hardware Company which occupied the building for years to the mid 20th century. Among the various businesses occupying the building was the musical instrument business of Thomas R. Young, Inc. The building is listed in the Maryland Inventory of Historic Properties (No. WI-265).","DateOfSite":"1886-87","NationalRegister":"","MD Inventory":"WI-265","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Dorman and Smyth Hardware Bldg 1.JPG","Data Source":"MD Inventory of Historic Properties","id":30,"uri":"Dorman%20%26%20Smyth%20Hardware%20Co.%20Building","photos":["http://apps.esrgc.org/scenicbyway/img/Dorman and Smyth Hardware Bldg 1.JPG"],"websites":[]},{"Name":"Double Mills","Category":"Historic Site","StreetAddress1":"25815 Grist Mill Drive","City":"Mardela Springs","County":"Wicomico","State":"MD","Zip":"21837","location":"38.464292, -75.717891","Description":"","DescriptionLong":"Double Mills is the last surviving water-powered, turbine driven mill. The first mill on the site, on the North bank of Barren Creek, was built in the 1700's. Through various stages of restoration, improvement, and additions it operated continuously until a major storm in 1979 tore out the dam and much of the race way. Today, efforts are underway to restore it to an educational heritage site, recalling the importance of milling - the first industry in the area - and the social hub of a rural community. The mill and general store, a part of the site from the late 1800's, are open to visitors by appointment.  Maryland Heritage Area funding (MHAA) has provided grant funding toward restoration of the building. ","DateOfSite":"Present Mill built around 1876 but estimated as far back as 1670 for the first mill in this location ","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://new.doublemills.org/\nhttp://new.doublemills.org/sponsors.html","Website addl":"http://new.doublemills.org/sponsors.html","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/doubleMills.jpg","Data Source":"","id":31,"uri":"Double%20Mills","photos":["http://apps.esrgc.org/scenicbyway/img/doubleMills.jpg"],"websites":["http://new.doublemills.org/","http://new.doublemills.org/sponsors.html"]},{"Name":"East Side Sports Complex (Willards Park)","Category":"Recreational","StreetAddress1":"7391 East Adkins Avenue","City":"Willards","County":"Wicomico","State":"MD","Zip":"21874","location":"38.392361, -75.342198","Description":"","DescriptionLong":"(20.4 acres park) The Eastside Youth Sports Complex and the Willards Park and Recreation Area are located right next to each other in the town of Willards. The Eastside Complex is the newer of the two facilities and provides three well-maintained baseball fields with electronic scoreboards, dugouts, and bleachers. Plus, there is a permanent concession building with restroom facilities and a nice playground area. The Eastside Complex is home to the Willards Little League, which offers several divisions of play including t-ball, machine-pitch, juniors, minors, and majors. The Willards Park and Recreation Area provides an additional ball field along with a basketball court, two tennis courts, a multi-use field, and a playground area with a pavilion. These parks are not maintained by the Department of Recreation, Parks, and Tourism but are still considered county parks as significant funding was provided in their development through Maryland’s Open Space Program. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/eastside-youth-sports-complex-willards-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/East Side Sports Complex Willards Park 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/East Side Sports Complex Willards Park 2.jpg\n","Data Source":"","id":32,"uri":"East%20Side%20Sports%20Complex%20(Willards%20Park)","photos":["http://apps.esrgc.org/scenicbyway/img/East Side Sports Complex Willards Park 1.jpg","http://apps.esrgc.org/scenicbyway/img/East Side Sports Complex Willards Park 2.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/eastside-youth-sports-complex-willards-park.html"]},{"Name":"Eastern Shore Baseball Hall of Fame Museum","Category":"Points of Interest/Sports","StreetAddress1":"Located inside the Arthur W Perdue Stadium ","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.367815, -75.529228","Description":"","DescriptionLong":" The Hall of Fame Museum opened on May 24, 1997 and is dedicated to the history, preservation and recognition of amateur, semi-pro and professional baseball as it was played in years past on the Del-Mar-Va peninsula.    Exhibits range from hundreds of photographs, uniforms, bats, balls, gloves, letters, programs, tickets, trophies, and other baseball memorabilia. Special displays make your visit more memorable.</p><p>  Also featured in the museum area is the Jimmie Foxx Home Run Club. This provides you with the opportunity to honor a special person or to remember a loved one. For $100.00, a bronze engraved plaque will be placed forever on this wall \"in honor of\" or \"in memory of\" that special person.    The museum is open for every Delmarva Shorebirds home game (doors open one hour prior to game time). At other times and during the off-season, the museum is open for tours by appointment only.  Free admission.</p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.esbhalloffame.org/index.cfm?ref=10100","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":33,"uri":"Eastern%20Shore%20Baseball%20Hall%20of%20Fame%20Museum","photos":[],"websites":["http://www.esbhalloffame.org/index.cfm?ref=10100"]},{"Name":"Edgewood Park","Category":"Recreational","StreetAddress1":"8497 Memory Garden Lane","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.426694829908804, -75.66272456616213","Description":"","DescriptionLong":"(12 acres park) Edgewood Park is located just off of Route 50 on Memory Garden Lane. It is a well maintained neighborhood park with a large playground area, basketball court, and recreational softball field. The playground area includes a Gametime play set for children ages 5 – 12, two swing sets, and several riding toys. There are benches spread throughout the park, next to the playground and basketball court, giving mom or dad a nice play to watch their kids play for a while. Edgewood Park is the only park in the immediate area, making it especially convenient for families in the surrounding neighborhoods. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/edgewood-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Edgewood Park 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Edgewood Park 2.jpg\n","Data Source":"","id":34,"uri":"Edgewood%20Park","photos":["http://apps.esrgc.org/scenicbyway/img/Edgewood Park 1.jpg","http://apps.esrgc.org/scenicbyway/img/Edgewood Park 2.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/edgewood-park.html"]},{"Name":"Ellis Bay Boat Ramp","Category":"Public Water Access","StreetAddress1":"Ellis Bay Wildlife Management Area","City":"Tyaskin","County":"Wicomico","State":"MD","Zip":"21865","location":"38.265178,-75.8906328","Description":"","DescriptionLong":"","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicoriver.org/access.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":35,"uri":"Ellis%20Bay%20Boat%20Ramp","photos":[],"websites":["http://www.wicomicoriver.org/access.html"]},{"Name":"Ellis Bay Boat Ramp","Category":"Recreational/Public Water Access","StreetAddress1":"Ellis Bay Wildlife Management Area","City":"Tyaskin","County":"Wicomico","State":"MD","Zip":"","location":"38.265178,-75.8906328","Description":"","DescriptionLong":"","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicoriver.org/access.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":36,"uri":"Ellis%20Bay%20Boat%20Ramp","photos":[],"websites":["http://www.wicomicoriver.org/access.html"]},{"Name":"Ellis Bay Water Trail","Category":"Recreational/Hiking and Biking Trails","StreetAddress1":"Wicomico River","City":"","County":"Wicomico","State":"MD","Zip":"","location":"","Description":"","DescriptionLong":"The Ellis Bay Water Trail is a potential water trail route through the Ellis Bay Wildlife Management Area. Ellis Bay is 3,000 acres of mostly marsh and forested wetland. Access sites are currently being considered by the county greenways board. Paddlers can access and explore the Wicomico River, Monie Bay, and Tangier Sound.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.dnr.state.md.us/greenways/counties/wicomico.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":37,"uri":"Ellis%20Bay%20Water%20Trail","photos":[],"websites":["http://www.dnr.state.md.us/greenways/counties/wicomico.html"]},{"Name":"Emerson C. Holloway Park","Category":"Recreational","StreetAddress1":"916 Mineola Avenue","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.378816, -75.615864","Description":"","DescriptionLong":"(10.5 acres park) Emerson C. Holloway Park is a large, wooded area located just around the block from the National Guard building on the west side of Salisbury. The neighborhood park has a spacious picnic area with several picnic tables, benches and grills for family cook-outs. There is also a playground area, two basketball courts, a recreational softball field, and a small pavilion with tables. In the summertime, Emerson Holloway is one of the county’s free Playground Program sites, providing supervised activities for children ages 5 and up from 9:30 – 4:30 each day. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/emerson-c-holloway-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Emerson C. Holloway Park 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Emerson C. Holloway Park 2.jpg\n","Data Source":"","id":38,"uri":"Emerson%20C.%20Holloway%20Park","photos":["http://apps.esrgc.org/scenicbyway/img/Emerson C. Holloway Park 1.jpg","http://apps.esrgc.org/scenicbyway/img/Emerson C. Holloway Park 2.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/emerson-c-holloway-park.html"]},{"Name":"F. Leonard Wailes Law Office","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"116-118, East Main Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.365397, -75.599786","Description":"Originally known  as he F. Leonard Wailes Law Office building, erected in 1927, is a two-story, four-bay, double-pile brick building facing north, opposite the Wicomico County Courthouse in a line of early- to mid-20th century commercial buildings. The building is distinguished by the neo-Federal architectural finishes including Flemish and common bond brickwork, with arched window and door openings defining the first floor and four 6/6 windows lighting the second floor. The cornice is trimmed with a finely executed series of tapered modillion blocks. The interior is finished with raised-panel wainscoting and ogee molded backband surrounds. A secondary entrance on the east side of the building opens into a side staircase that rises to the second floor office space.","DescriptionLong":"The F. Leonard Wailes Law Office building is significant for its architectural character. Designed by Salisbury architect W. Twilley Malone and constructed in 1927, the two-story, four-bay brick building is a particularly fine and well preserved example of early-20th century law office design incorporating neo-Federal elements in an adaptation of an urban townhouse form. The exterior is richly detailed with Flemish bond masonry, arched openings with leaded transoms, and a finely crafted modillion cornice apparently derived from a local 19th century source. The building retains the majority of its original interior plan and finishes as well, including raised-panel wainscoting, ogee molded backbands framing windows and doors, and a large built-in safe.","DateOfSite":"Erected in 1927","NationalRegister":"4/14/1997","MD Inventory":"WI-211","In Historic District":"Downtown Salisbury","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/FLWailesLaw.jpg\nhttp://apps.esrgc.org/scenicbyway/img/F Leonard Wailes Law Office Bldg 2.JPG","Data Source":"MD National Register","id":39,"uri":"F.%20Leonard%20Wailes%20Law%20Office","photos":["http://apps.esrgc.org/scenicbyway/img/FLWailesLaw.jpg","http://apps.esrgc.org/scenicbyway/img/F Leonard Wailes Law Office Bldg 2.JPG"],"websites":[]},{"Name":"Faith Community Church formerly Asbury Methodist Church","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"219 S Division Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.367601, -75.599930","Description":"","DescriptionLong":"Formerly the Asbury Methodist Church, the building which now houses the Faith Community Church has been a part of a long and colorful history.  In 1778 the first Methodist Society of Salisbury was formed and in the 1790's the present lot on Division St. was purchased.  In 1801, the first Methodist church known as the \"Old Red Meeting House\" was built on this lot.  The congregation incorporated on August 22, 1807 as \"The Methodist Episcopal Church in the vicinity of Salisbury.\"</p><p></p><p>In 1856, a white frame church with green shutters was erected but was destroyed in the great Salisbury Fire of 1886.  Following the fire the \"Old Red Meeting House\" was again used for worship (as well as the Salisbury Post Office) until the present stone church building was completed in 1887.  The name of the congregation was then changed to Asbury Methodist Church.  In 1963 Asbury Methodist Church relocated near Salisbury University and the building was unused until 1966. </p><p></p><p>Late 1950's, five local couples from Salisbury contacted Rev. J. Harvey Dixon about there not being services conducted at the Wicomico County Jail or Pine Bluff State Tubercular Hospital.  Rev. Dixon with this group began to hold services in both these institutions on a weekly basis.  Rev. Dixon had been an ordained minister with the Holiness Christian Church of the United States of America, Inc. since 1953.  But in 1965 he resigned from the Holiness Christian Church and joined with this group to form an independent community church.  This group incorporated as The Faith Community Church of Salisbury, Maryland, Inc. in 1966 and purchased this old landmark church.  Their goal was to restore it as a desirable place to worship and to promote Biblical values in the community.</p><p>•  The \"Old Red Meeting House\" was built 18 years before a stove was installed.</p><p>•  A tombstone in the graveyard is that of Sallie Brewington, daughter of one of the incorporators.  She died on her wedding day. The inscription reads, \"My Sallie, the Bride of Christ.\"  </p><p>","DateOfSite":"1801","NationalRegister":"","MD Inventory":"WI-63","In Historic District":"","MD Military Monuments":"","Website":"http://faithcommunitysby.org/historical-landmark","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/FaithChurch.jpg","Data Source":"","id":40,"uri":"Faith%20Community%20Church%20formerly%20Asbury%20Methodist%20Church","photos":["http://apps.esrgc.org/scenicbyway/img/FaithChurch.jpg"],"websites":["http://faithcommunitysby.org/historical-landmark"]},{"Name":"Farmers' and Merchant's Bank","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"206 Main Street","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.365223, -75.601862","Description":"","DescriptionLong":"The Farmers' and Merchant's Bank structure, built in 1929, replaced an early 20th century bank structure. The building ceased being a bank in 1990 when it was acquired as an architectural and engineering office. The building stands as a fine example of the Art Deco architectural design influence. The building is listed in the Maryland Inventory of Historic Properties (No. WI-264).","DateOfSite":"1929","NationalRegister":"","MD Inventory":"WI-264","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Farmers and Merchants Bank Bldg 1.JPG","Data Source":"MD Inventory of Historic Properties","id":41,"uri":"Farmers'%20and%20Merchant's%20Bank","photos":["http://apps.esrgc.org/scenicbyway/img/Farmers and Merchants Bank Bldg 1.JPG"],"websites":[]},{"Name":"First National Bank Building","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"201 Main Street","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.365553, -75.601719","Description":"","DescriptionLong":"The old Salisbury National Bank, built in 1930, was constructed on the site of the former Peninsula Hotel, a brick structure which had been built following the 1886 fire. After the hotel burned in the mid 1920s, the property was acquired by the directors of the Salisbury National Bank which financed the bank construction. The building is listed in the Maryland Inventory of Historic Properties (No. WI-263).","DateOfSite":"1930","NationalRegister":"","MD Inventory":"WI-263","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/First National Bank Bldg 1.JPG","Data Source":"MD Inventory of Historic Properties","id":42,"uri":"First%20National%20Bank%20Building","photos":["http://apps.esrgc.org/scenicbyway/img/First National Bank Bldg 1.JPG"],"websites":[]},{"Name":"Franklin Hotel (Chesapeake East)","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"501 West Main Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.365292, -75.605360","Description":"","DescriptionLong":"This restored structure at West Main and Lake Streets has been occupied by various businesses. It is referred to as the Franklin Hotel for its prominence as an African American hotel. The hotel was listed in a 1956 advertisement, managed by Melvin Hutt. It was one of only a few hotels available to African Americans during the time of segregation. At the corner of the building there is the 1930 concrete plaque, and a second concrete plaque embossed with the name \"Mainlake Building.\"  The current owners extensively restore the building and operate Chesapeake East, an artisan studio and gallery. The building is listed in the MD Inventory of Historic Properties.","DateOfSite":"1930","NationalRegister":"","MD Inventory":"WI-330","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Franklin Hotel 1.JPG\nhttp://apps.esrgc.org/scenicbyway/img/Franklin Hotel 2.JPG","Data Source":"MD Inventory of Historic Properties/Spring 1956 \"The Negro Traveler's Green Book\"","id":43,"uri":"Franklin%20Hotel%20(Chesapeake%20East)","photos":["http://apps.esrgc.org/scenicbyway/img/Franklin Hotel 1.JPG","http://apps.esrgc.org/scenicbyway/img/Franklin Hotel 2.JPG"],"websites":[]},{"Name":"Friendship United Methodist Church Marker and Allen African American School ","Category":"Historic Marker/Historic Site","StreetAddress1":"Friendship United Methodist Church Marker and Allen African American School ","City":"Allen","County":"Wicomico","State":"MD","Zip":"21810","location":"38.299166666666665, -75.69111666666667","Description":"","DescriptionLong":"A community of free African-Americans had grown up along Old Knight's Road, now Upper Ferry Road, by the 1830's. The first church at this location was built in the autumn of 1864 and was part of the Delaware Conference, organized July 29 of the same year. The original building was 20' by 24'. The present church was built a few feet from the first in 1888 on ground given by Rufus Fields. The first pastor was Rev. Harrison T. Rich. Camp meetings and prayer bands were a part of the worship services until the 1940's. Early leaders were Samuel Solomon, Jacob Cottman and Aaron Gale. The educational center opposite the church was originally a school, which served Allen's African-American community from 1895 until 1955. The first African-American school in Trappe District was created in the 1870's at another location. The 1895 building originally had one room, later enlarged to two, and served grades one through seven.</p><p>Erected 2000 by Allen Historical Society, Inc. with funding from the Lower Eastern Shore Heritage Committee - A Maryland 2000 Project.</p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"2000","In Historic District":"","MD Military Monuments":"","Website":"http://www.hmdb.org/marker.asp?marker=67163","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Friendship UMchurchAllenAfricanAmSchool 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/FriendshipChurch.jpg","Data Source":"","id":44,"uri":"Friendship%20United%20Methodist%20Church%20Marker%20and%20Allen%20African%20American%20School%20","photos":["http://apps.esrgc.org/scenicbyway/img/Friendship UMchurchAllenAfricanAmSchool 1.jpg","http://apps.esrgc.org/scenicbyway/img/FriendshipChurch.jpg"],"websites":["http://www.hmdb.org/marker.asp?marker=67163"]},{"Name":"Fruitland MHT marker","Category":"Historic Marker/Historic Site","StreetAddress1":"401 East Main Street","City":"Fruitland","County":"Wicomico","State":"MD","Zip":"21826","location":"","Description":"","DescriptionLong":"Community traces its origins to about 1795 when a village began to cluster around an intersection known as Disharoon's Cross Roads. One of the roads was the dividing line between Somerset and Worcester Counties, making the village politically fragmented until 1867, when Wicomico County was formed from portions of the two counties.     About 1820, the village became known as Forktown, because it was located at the fork of two roads which were used by stage coaches traveling north and south. The stage coach route originated in Accomac, Virginia and continued to Philadelphia, Pennsylvania. The stage coaches would stop at Forktown, change horses and continue on their way. Fruitland City Hall is now at the site of this historic location. When the railroad arrived at the conclusion of the Civil War more development shifted to the area of the railroad. In 1873, the name of the town was changed to Fruitland because of the large number of fruits growing and being harvested in the area.                                                                   Fruitland was not incorporated until 1947 when the population began to expand rapidly because of its closeness to Salisbury.</p><p>Fruitland held the first (and largest) holly auction every year for three days in December, from the late 1890s until December 1968. The demand for homemade wreaths decreased as artificial wreaths were manufactured. Besides holly, mistletoe was also sold by the bushel basket at the auctions. Wreaths were sold and shipped to brokers in Baltimore, Philadelphia and Washington, DC, but sometimes were shipped as far west as Chicago.</p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"Yes   - cannot find on mht site but is mht marker","In Historic District":"","MD Military Monuments":"","Website":"http://www.cityoffruitland.com/userfiles/image/Scan_Pic0046.jpg","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/FruitlandMHT.jpg","Data Source":"","id":45,"uri":"Fruitland%20MHT%20marker","photos":["http://apps.esrgc.org/scenicbyway/img/FruitlandMHT.jpg"],"websites":["http://www.cityoffruitland.com/userfiles/image/Scan_Pic0046.jpg"]},{"Name":"Fruitland Recreational Park","Category":"Recreational","StreetAddress1":"200 Brown Street","City":"Fruitland","County":"Wicomico","State":"MD","Zip":"21826","location":"38.3135423, -75.6186954","Description":"","DescriptionLong":"(39.3 acres park) The Fruitland Recreational Park and Annex are located across the street from each other on Brown Street in Fruitland. The complex is an incredible resource for both youth and adult sports in the community and the City takes great pride in the park. The Recreational Park spans 27 acres and provides four Little League baseball fields, one adult softball field and two soccer fields (one large and one small). There are also two concessions buildings, restroom facilities, a pavilion with picnic tables and a grill, a large playground area and horseshoe pits. The baseball fields are used by the Fruitland Little League which includes the following divisions: 5/6 year olds, 7/8 year olds, Minor League, Major League, Junior League, and Senior League. The Park Annex, which spans 11 acres, provides two additional softball fields, a Senior Little League field, a small soccer field, a lighted football/lacrosse field (Red Men Field), two concessions buildings with restrooms, a pavilion with picnic tables, a playground area and a walking trail. Red Men Field is home to the Fruitland Falcons Youth Sports Organization which includes programs in youth football, lacrosse, and cheerleading. The softball fields are home to the County’s Junior Girls’ Softball Program and are also used for large tournaments such as the USSSA World Series.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/fruitland-recreational-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Fruitland Recreational Park 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Fruitland Recreational Park 2.jpg","Data Source":"","id":46,"uri":"Fruitland%20Recreational%20Park","photos":["http://apps.esrgc.org/scenicbyway/img/Fruitland Recreational Park 1.jpg","http://apps.esrgc.org/scenicbyway/img/Fruitland Recreational Park 2.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/fruitland-recreational-park.html"]},{"Name":"Furnace Town Living History Museum","Category":"Historic Site/Heritage Tourism/Museum","StreetAddress1":"3816 Old Furnace Road","City":"Snow Hill","County":"Worcester","State":"MD","Zip":"21863","location":"38.204866, -75.469719","Description":"","DescriptionLong":"Located in the heart of the Pocomoke Forest, Furnace Town is home to Maryland's only bog ore iron furnace. The furnace is situated 5 miles north of Snow Hill on the banks of Nassawango Creek. Furnace Town and its Nassawango Iron Furnace (recognized by The American Society of Mechanical Engineers as a National Historic Mechanical Engineering Landmark) comprise an educational site of local archaeological and historical interest. The furnace and buildings are being restored, preserved and interpreted by Furnace Town Foundation, Inc.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.furnacetown.com/","Website addl":"http://www.worcestermuseums.org/furnace-town.php","Additional Information":"","Photo":"","Data Source":"","id":47,"uri":"Furnace%20Town%20Living%20History%20Museum","photos":[],"websites":["http://www.furnacetown.com/"]},{"Name":"Gen John Henry Winder","Category":"Historic Marker","StreetAddress1":"Division and Main Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.365516666666664,-75.60053333333333","Description":"","DescriptionLong":"Sign was erected by MD Civil War Centennial Commission. Sign identifies General John Henry Winder * “Born near Nanticoke, John Henry Winder was successively a graduate and instructor at West Point. A veteran of the Seminole and Mexican wars, Gen. Winder joined the Confederacy in 1861, and eventually directed all Confederate military prisons east of the Mississippi.”","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.hmdb.org/Marker.asp?Marker=3858","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Gen John Henry Winder 1.JPG","Data Source":"","id":48,"uri":"Gen%20John%20Henry%20Winder","photos":["http://apps.esrgc.org/scenicbyway/img/Gen John Henry Winder 1.JPG"],"websites":["http://www.hmdb.org/Marker.asp?Marker=3858"]},{"Name":"Gene Lowe Park","Category":"Recreational","StreetAddress1":"714 State Street","City":"Sharptown","County":"Wicomico","State":"MD","Zip":"21861","location":"38.5358808, -75.72248330","Description":"","DescriptionLong":"(3.7 acres park) Gene Lowe Park is located on State Street in Sharptown, Maryland, about 15 minutes from Salisbury. The spacious neighborhood park provides the local community with a basketball court, a full size soccer field with bleachers, and a playground area. The playground includes a Gametime playset for school age children with slides and climbing equipment. The parking lot can be accessed from State Street by turning on Nanticoke Street and following it just past the playground area. Located within walking distance of many Sharptown neighborhoods, Gene Lowe Park is a great place for local residents to come out and play. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/gene-lowe-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Gene Lowe Park 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Gene Lowe Park 2.jpg\n","Data Source":"","id":49,"uri":"Gene%20Lowe%20Park","photos":["http://apps.esrgc.org/scenicbyway/img/Gene Lowe Park 1.jpg","http://apps.esrgc.org/scenicbyway/img/Gene Lowe Park 2.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/gene-lowe-park.html"]},{"Name":"Gordy Park","Category":"Recreational","StreetAddress1":"505 South Pennsylvania Avenue","City":"Delmar","County":"Wicomico","State":"MD","Zip":"21875","location":"38.451070637514, -75.5783875","Description":"","DescriptionLong":"(5.5 acres park) Gordy Park has four ball fields of varying sizes along with lights, electronic scoreboards, bleachers, and concession stands. These amenities make it well equipped to host the range of Delmar’s Little League teams which include t-ball, coach pitch, baseball, and softball. In addition to the ball fields, Gordy Park has a large playground area with sheltered picnic tables. Next to the playground are two fenced basketball courts and a skate park with ramps, both added as part of a renovation project in 2009. A cooperative effort among many organizations, Gordy Park is provided by the following: J. William Gordy, Delmar Kiwanis Club, Delmar VFW, Delmar Lion’s Club, Town of Delmar, Wicomico County, Maryland Program Open Space, and Maryland Department of Natural Resources. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/gordy-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Gordy Park 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Gordy Park 2.jpg","Data Source":"","id":50,"uri":"Gordy%20Park","photos":["http://apps.esrgc.org/scenicbyway/img/Gordy Park 1.jpg","http://apps.esrgc.org/scenicbyway/img/Gordy Park 2.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/gordy-park.html"]},{"Name":"Great Fire of Salisbury","Category":"Points of Interest/Historic Site","StreetAddress1":"","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"","location":"38.365516666666664, -75.60053333333333","Description":"","DescriptionLong":"Free standing Marker commemorating the Great Fire of Salisbury. It is located in front of the old courthouse.  It reads *“On October 17, 1886 a small fire was discovered at Toadvine's Livery Stable on Dock Street, now Market Street. Fire spread very rapidly and eventually consumed 200 buildings including most of the commercial district. Soon after the fire began, Salisbury requested assistance from the other towns on the shore. Crisfield, Pocomoke City and Wilmington loaded their fire department steamers on special railroad trains and sent them to Salisbury's aid. The fire was brought under control on October 18, 1886, 17 hours after it began. Twenty-two acres in the center of Salisbury were consumed and only through the valiant efforts of the neighboring towns was the present county courthouse saved.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.hmdb.org/Marker.asp?Marker=3860","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/greatfireSalisbury.jpg","Data Source":"","id":51,"uri":"Great%20Fire%20of%20Salisbury","photos":["http://apps.esrgc.org/scenicbyway/img/greatfireSalisbury.jpg"],"websites":["http://www.hmdb.org/Marker.asp?Marker=3860"]},{"Name":"Greater Salisbury Building (County Trust Company Building)","Category":"Historic Site","StreetAddress1":"200 Main Street","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.365263, -75.601602","Description":"","DescriptionLong":"Now known as the Greater Salisbury Building, the County Trust Company building was built about 1930 for the Eastern Shore Trust Company in the distinctive Art Deco design style. This had been the site of bank structures both before and after the 1886 fire. The building is listed in the Maryland Inventory of Historic Properties (No. WI-262).","DateOfSite":"c.1930 ","NationalRegister":"","MD Inventory":"WI-262","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Greater Salisbury Bldg 1.jpg","Data Source":"MD Inventory of Historic Properties","id":52,"uri":"Greater%20Salisbury%20Building%20(County%20Trust%20Company%20Building)","photos":["http://apps.esrgc.org/scenicbyway/img/Greater Salisbury Bldg 1.jpg"],"websites":[]},{"Name":"Green Hill Church, also known as St Bartholomew’s Episcopal Church","Category":"Historic Site","StreetAddress1":"Green Hill Church Road,","City":"Quantico","County":"Wicomico","State":"MD","Zip":"21856","location":"38.30682, -75.762964","Description":"","DescriptionLong":"The single-story, Flemish bond gable-front brick church was built in 1733, as is shown in the restored brickwork on the end facing the water. The interior is spare, with box pews and several memorial plaques to long-serving rectors, as well as William Murray Stone who became Episcopal Bishop of Maryland. Adjacent to the church are several marked burials with 18th and 19th century stones, as well as agricultural fields and a golf course.  It was listed on the National Register of Historic Places in 1975.[1]  The church no longer holds regular services. It is opened at least once a year in August for a St. Bartholomew's Day worship service held by several local Episcopal churches. It is one of the outstanding 18th century architectural survivals remaining on the lower Eastern Shore.  The church was originally constructed to be part of Green Hill Town, a port of entry created as part of an Act of Provincial Assembly in 1706. ","DateOfSite":"1733","NationalRegister":"1975 WI-2  Certified as a national historic site June 4, 1975 ","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://en.wikipedia.org/wiki/St._Bartholomew%27s_Episcopal_Church_%28Quantico,_Maryland%29\nhttp://www.mht.maryland.gov/nr/NRDetail.aspx?HDID=305&COUNTY=Wicomico&FROM=NRCountyList.aspx?COUNTY=Wicomico","Website addl":"http://www.mht.maryland.gov/nr/NRDetail.aspx?HDID=305&COUNTY=Wicomico&FROM=NRCountyList.aspx?COUNTY=Wicomico","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/greenhillChurch.jpg","Data Source":"","id":53,"uri":"Green%20Hill%20Church%2C%20also%20known%20as%20St%20Bartholomew%E2%80%99s%20Episcopal%20Church","photos":["http://apps.esrgc.org/scenicbyway/img/greenhillChurch.jpg"],"websites":["http://en.wikipedia.org/wiki/St._Bartholomew%27s_Episcopal_Church_%28Quantico,_Maryland%29","http://www.mht.maryland.gov/nr/NRDetail.aspx?HDID=305&COUNTY=Wicomico&FROM=NRCountyList.aspx?COUNTY=Wicomico"]},{"Name":"Greenhill Town and Port Marker","Category":"Historic Marker/Historic Site","StreetAddress1":"Marker is at the intersection of Salisbury Parkway (Business U.S. 50) and Naticoke Road (Maryland Route 349), on the right when traveling east on Salisbury Parkway.","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.36945, -75.61445","Description":"","DescriptionLong":"Authorized by act of Assembly 1706 (one of 6 ports) \"where vessels shall unlade Negroes wares merchandizes and commodities\" 100 acres to be laid out in lots with open spaces left for church, market place, and public buildings. Present church built in 1733.  Erected by State Roads Commission. In Salisbury, Maryland, in Wicomico County","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.hmdb.org/Marker.asp?Marker=19236","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Green Hill Town and Port marker 1.JPG","Data Source":"","id":54,"uri":"Greenhill%20Town%20and%20Port%20Marker","photos":["http://apps.esrgc.org/scenicbyway/img/Green Hill Town and Port marker 1.JPG"],"websites":["http://www.hmdb.org/Marker.asp?Marker=19236"]},{"Name":"Greenway – Nassawango Creek Preserve","Category":"Recreational","StreetAddress1":"","City":"","County":"Wicomico","State":"MD","Zip":"","location":"","Description":"","DescriptionLong":"The Nassawango Creek Preserve is an established greenway along the Nassawango Creek. The Nature Conservancy owns about 3,300 acres along the Nasawango in Wicomico and Worcester counties. In Wicomico County, the Wicomico State Forest provides additional preserved land along the creek. </p><p></p><p>This corridor serves environmental protection purposes by providing habitat for plants and animals and also protects water quality in the creek which is home to some of the northernmost bald cypress forest in the country. Much of the area is not suitable for public access; however, there are a few nature trails. The Nassawango Creek Preserve is also accessible by canoe from Red House Road at a newly-constructed put-in, and canoe rentals are available in Snow Hill. </p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.dnr.state.md.us/greenways/wicomico.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":55,"uri":"Greenway%20%E2%80%93%20Nassawango%20Creek%20Preserve","photos":[],"websites":["http://www.dnr.state.md.us/greenways/wicomico.html"]},{"Name":"Greenway – Pocomoke River Regional Greenway","Category":"Recreational","StreetAddress1":"","City":"","County":"Wicomico","State":"MD","Zip":"","location":"","Description":"","DescriptionLong":"The Pocomoke river Regional Greenway is a potential multi-county greenway along the Pocomoke Scenic River in Wicomico, Worcester and Somerset counties. Although the land along this corridor in Wicomico county is privately owned, it is protected by critical area regulations and local zoning. Paths for a tax ditch association are maintained by the local government. This area is not suitable for public access but is an excellent wildlife corridor. There are significant public landholdings along the river in Worcester County. The Lower Eastern Shore Heritage Committee was formed in 1993 to help plan and coordinate natural and heritage resources in the region and may formulate additional greenway recommendations.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.dnr.state.md.us/greenways/wicomico.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":56,"uri":"Greenway%20%E2%80%93%20Pocomoke%20River%20Regional%20Greenway","photos":[],"websites":["http://www.dnr.state.md.us/greenways/wicomico.html"]},{"Name":"Greenways – Nanticoke Greenway","Category":"Recreational","StreetAddress1":"","City":"","County":"","State":"","Zip":"","location":"","Description":"","DescriptionLong":"Nanticoke River is a partially-established stream valley greenway. The river was studied by the Maryland Scenic and Wild Rivers Program and was found to possess nationally significant natural, recreational and cultural values. Several thousand acres are protected in Wicomico and Dorchester counties by the Nanticoke river and Fishing Bay Wildlife Management Areas. Significant acreage is also protected by several natural heritage sites along the river in both Dorchester and Wicomico counties.  </p><p>Much of the land along the river corridor is undeveloped and privately owned. Most of the surrounding land is either marsh land, wooded swamp or upland forest. As such, this greenway corridor is ideal for wildlife. Bass fishing, boating and canoeing are activities currently enjoyed on the river. Portions of private land are protected by non-profit organizations such as The Nature Conservancy, Boy Scouts of America and religious organizations.</p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.dnr.state.md.us/greenways/wicomico.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/nanticokeGreenway.jpg","Data Source":"","id":57,"uri":"Greenways%20%E2%80%93%20Nanticoke%20Greenway","photos":["http://apps.esrgc.org/scenicbyway/img/nanticokeGreenway.jpg"],"websites":["http://www.dnr.state.md.us/greenways/wicomico.html"]},{"Name":"H. S. Brewington Building (Old Synagogue Building)","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"300-304 West Main Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.365142, -75.603153","Description":"The prominent structure on West Main Street at the corner of Market Street, with its distinctive architectural features, was built in 1892 for Henry S. Brewington. The building is commonly known as the “Old Synagogue Building” because the congregation occupied the building from 1932 to 1952.","DescriptionLong":"The prominent structure on West Main Street at the corner of Market Street, distinctive for its octagonal turret, gothic and stained glass windows, was built in 1892 for Henry S. Brewington; however, the building is commonly referred to as the “Old Synagogue Building” for the congregation which utilized the building for the longest time period. The building’s first occupant was the Farmers and Merchants Bank of Salisbury; the bank moved to a new location in 1904. The second floor was used as a Masonic Hall from 1894 to 1931. The building was occupied by several clothing merchants, including the Nock Brothers men’s clothing store, which opened in 1908. It is believed that Peninsula Trust Company occupied the first floor in May 1911 following the Nock firm’s closing. Beth Israel Congregation began using the second floor in 1932 until they moved to the newly-built synagogue building on Camden Avenue at Wicomico Street in 1952. </p><p></p><p>The structure was built on the site of property destroyed by the fire of 1886 which destroyed all buildings on Main Street and Market Street (then known as Dock Street). Prior to the fire, the property belonged to Christopher C. Trader of Wicomico County. Heirs conveyed the property to Henry S. Brewington in 1891. </p><p>","DateOfSite":"1892","NationalRegister":"","MD Inventory":"WI-134","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/hsBrewingtonBuilding.jpg","Data Source":"Maryland Historical Trust State Historic Sites Inventory Form, Jacqueline F. Dianich, Anne Clay and Lucile Horsley, Members, MHT, Feb. 5, 1981","id":58,"uri":"H.%20S.%20Brewington%20Building%20(Old%20Synagogue%20Building)","photos":["http://apps.esrgc.org/scenicbyway/img/hsBrewingtonBuilding.jpg"],"websites":[]},{"Name":"Harmon Field","Category":"Recreational","StreetAddress1":"409 Church Hill Avenue","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21804","location":"38.356958, -75.581773","Description":"","DescriptionLong":"(3.0 acres park) Harmon Field is centrally located in Salisbury, just behind the YMCA and around the corner from the Zoo and City Park. The well-maintained, lighted softball field hosts many games from Wicomico County’s recreational softball leagues as well as some invitational tournament games. In addition to the softball field, Harmon has a nice basketball court which is perfect for pick-up games or just shooting around. Plus, there’s a swing set and open field for kids to enjoy while watching mom or dad’s softball game. Overall, Harmon Field is a great place to get out and play. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/harmon-field.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Harmon Field 1.jpg","Data Source":"","id":59,"uri":"Harmon%20Field","photos":["http://apps.esrgc.org/scenicbyway/img/Harmon Field 1.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/harmon-field.html"]},{"Name":"Hebron Park and Community Center","Category":"Recreational","StreetAddress1":"212 West Church Street","City":"Hebron","County":"Wicomico","State":"MD","Zip":"21830","location":"38.422593, -75.693187","Description":"","DescriptionLong":"(8.0 acres park) Hebron Park and Community Center, often referred to as “Lion’s Park”, is located just around the corner from the carnival grounds in Hebron on West Church Street. As suggested by its nickname, the park was a joint venture between the Hebron Lion’s Club, Wicomico County, and Maryland’s Program Open Space. The well maintained park has a lighted softball field with bleachers, lighted tennis courts, a spacious playground area, a basketball court, a pavilion with picnic tables, and a small concessions building with restroom facilities. Also on the property is the Lion’s Club Community Center which is used regularly for meetings and special events, such as the Hebron Easter Egg Hunt. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/hebron-park-and-community-center.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Hebron Park and Community Center 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Hebron Park and Community Center 2.jpg","Data Source":"","id":60,"uri":"Hebron%20Park%20and%20Community%20Center","photos":["http://apps.esrgc.org/scenicbyway/img/Hebron Park and Community Center 1.jpg","http://apps.esrgc.org/scenicbyway/img/Hebron Park and Community Center 2.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/hebron-park-and-community-center.html"]},{"Name":"Henry S. Parker Athletic Complex","Category":"Recreational","StreetAddress1":"711 Naylor Mill Road","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.4090429, -75.5930649","Description":"","DescriptionLong":"(41.0 acres park) The Henry S. Parker Athletic Complex, located on Naylor Mill Drive in Salisbury, is Wicomico County, Maryland's premier outdoor sports facility. Encompassed by shade trees and marked by expertly maintained fields, the complex was recognized as the 1987 Most Beautiful and Functional Park and the 2004 National Softball Association's Outstanding Park. Recently renovated, the complex boasts four softball fields (three lighted), one lighted baseball field, two lighted Bermuda Turf utility fields, two full service concession stands with restroom facilities, a shaded playground area, plenty of spectator seating and free parking for 720 vehicles. The fields are equipped with high quality drainage and irrigation systems and are maintained by a full time maintenance team. These features make the complex ideal for hosting major tournaments.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/henrys-parker-athletic-complex.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Henry S. Parker Athletic Complex 1.jpg","Data Source":"","id":61,"uri":"Henry%20S.%20Parker%20Athletic%20Complex","photos":["http://apps.esrgc.org/scenicbyway/img/Henry S. Parker Athletic Complex 1.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/henrys-parker-athletic-complex.html"]},{"Name":"Holloway Hall MHT Marker","Category":"Historic Marker/Historic Site","StreetAddress1":"1101 Camden Avenue","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.34805, -75.60778333333333","Description":"","DescriptionLong":"Original building of the Salisbury State Normal School, the first public institution on the Eastern Shore for the training of teachers for Maryland's public schools. Opened in 1925 and expanded in 1928 and 1932, it was until 1950 the only building on campus, housing classrooms, dormitories, faculty and administrative offices, auditorium, gymnasium, and dining hall. Named for Dr. William Holloway, first president of the school. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.hmdb.org/marker.asp?marker=39783\nhttp://mht.maryland.gov/historicalmarkers/Details.aspx?id=RM856&recNum=1&town=salisbury\n","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Holloway  Hall MHT Marker 1.JPG","Data Source":"","id":62,"uri":"Holloway%20Hall%20MHT%20Marker","photos":["http://apps.esrgc.org/scenicbyway/img/Holloway  Hall MHT Marker 1.JPG"],"websites":["http://www.hmdb.org/marker.asp?marker=39783","http://mht.maryland.gov/historicalmarkers/Details.aspx?id=RM856&recNum=1&town=salisbury"]},{"Name":"Humphreys Red Cannon at Courthouse","Category":"Historic Site","StreetAddress1":"101 N Division Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.36585, -75.60031666666667","Description":"","DescriptionLong":"Small red cannon sits on the front of the Courthouse Plaza lawn. The Maryland Military Monuments Inventory lists this cannon as commemorating the War of 1812.</p><p></p><p>Plaque reads: Gift to the Wicomico Historical Society by</p><p>Mary Elizabeth Humphreys, Granddaughter of General Humphrey Humphreys</p><p>Restored by Liebman-Berger Memorial Post No. 707</p><p>Jewish War Veterans of the U.S.A.  Dedicated May 7, 1977</p><p></p><p>It is unknown if Humphrey Humphreys was a actual General or if this was a term of endearment.       *A long-time fixture at the front gate of the Humphreys house were several cannons, which in Humphrey Humphreys' 1882 will were bequeathed to this three sons, Lafayette, Eugene, and Randloph. One cannon survives and is now located on the front lawn of the Wicomico County Courthouse. It was given to the city by Mary Elizabeth Humphreys, who retained ownership of the Broad Street house until late 1960s. She sold the property to John W.T. Webb and K. King Burnett, who sensitively adapted the house as law offices to this day.  The Humphrey Humphreys house, documented by an inscribed board to 1856, stands prominently along 115 Broad Street in the center of Salisbury.</p><p>","DateOfSite":"","NationalRegister":"MHY1JC6","MD Inventory":"","In Historic District":"","MD Military Monuments":"Yes War of 1812","Website":"http://www.hmdb.org/marker.asp?marker=81087\nhttp://www.historicalmarkerproject.com/markers/HM1JC6_the-general-humphreys-cannon_Salisbury-MD.html\n* http://webbburnettlaw.com/our_offices.cfm","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/oldCannon1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/oldCannon2.jpg","Data Source":"","id":63,"uri":"Humphreys%20Red%20Cannon%20at%20Courthouse","photos":["http://apps.esrgc.org/scenicbyway/img/oldCannon1.jpg","http://apps.esrgc.org/scenicbyway/img/oldCannon2.jpg"],"websites":["http://www.hmdb.org/marker.asp?marker=81087","http://www.historicalmarkerproject.com/markers/HM1JC6_the-general-humphreys-cannon_Salisbury-MD.html","* http://webbburnettlaw.com/our_offices.cfm"]},{"Name":"I.O.O.F. Building","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"132-134 Main Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.36545, -75.599136","Description":"","DescriptionLong":"The cornerstone of the Odd Fellows Temple of Newton Lodge No. 56 on East Main Street was laid in March of 1921. The building was constructed on land reclaimed from the muddy pond bottom of Humphreys Lake which drained 1909. Initial preparation for construction began with a contract with Capt. Otis S. Lloyd who drove piles into the muddy pond bottom for foundation construction. During the mid 20th century, the New Theatre, a movie theatre, operated on the first floor. The building was later divided for professional offices. The building is listed in the Maryland Inventory of Historic Properties (No. WI-583).","DateOfSite":"1920-21","NationalRegister":"","MD Inventory":"WI-583","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/IOOF Building 1.jpg","Data Source":"MD Inventory of Historic Properties","id":64,"uri":"I.O.O.F.%20Building","photos":["http://apps.esrgc.org/scenicbyway/img/IOOF Building 1.jpg"],"websites":[]},{"Name":"Indian Village Playground","Category":"Recreational","StreetAddress1":"903 Manoa Blvd.","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.384452, -75.615953","Description":"","DescriptionLong":"(6.0 acres park) Indian Village Playground is a neighborhood park located just a few blocks from Route 50 on the west side of Salisbury. The wooded park is nicely shaded and has a spacious playground area, two basketball courts, and a recreational softball field. There is also a permanent building with a small storage room, a covered area with picnic tables, and restroom facilities. In the summertime, Indian Village is one of the county’s free Playground Program sites, providing supervised activities for children ages 5 and up from 9:30 – 4:30 each day.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/indian-village-playground.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Indian Village Playground 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Indian Village Playground 2.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Indian Village Playground 2.jpg","Data Source":"","id":65,"uri":"Indian%20Village%20Playground","photos":["http://apps.esrgc.org/scenicbyway/img/Indian Village Playground 1.jpg","http://apps.esrgc.org/scenicbyway/img/Indian Village Playground 2.jpg","http://apps.esrgc.org/scenicbyway/img/Indian Village Playground 2.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/indian-village-playground.html"]},{"Name":"Jay Williams Law Office Building","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"116 Division Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.366058, -75.600629","Description":"","DescriptionLong":"This building was constructed in two stages. The initial 2-story brick office was erected around 1895-96 following the 1886 fire. Jeanette C. Williams of New York had purchased the lot from the Ulman family and financed the construction. Seven years later the property transferred to attorney Jay Williams. Sometime between 1904 and 1911, the building was expanded to a 3-story structure.  The building is listed in the Maryland Inventory of Historic Properties (No. WI-269).","DateOfSite":"c.1905-10","NationalRegister":"","MD Inventory":"WI-269","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Jay Williams Law Office Bldg 1.JPG","Data Source":"MD Inventory of Historic Properties","id":66,"uri":"Jay%20Williams%20Law%20Office%20Building","photos":["http://apps.esrgc.org/scenicbyway/img/Jay Williams Law Office Bldg 1.JPG"],"websites":[]},{"Name":"Johnson School-House Game Refuge","Category":"Historic Site/Recreational","StreetAddress1":"Mt. Olive Road","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21804","location":"38.3038, -75.50005","Description":"","DescriptionLong":"175 acres, purchased May 25, 1926, from L. Atwood Bennett, attorney for mortgagee; from hunter’s license fund for the purpose of propagating game. 115-acre pocket of forest and fields in southern Wicomico County, the Johnson WMA was purchased by the state in 1926, when the United States was first recognizing the growing need to conserve natural resources. It was originally called Johnson Schoolhouse Game Refuge and was used to raise game animals for release into the wild. Today, Johnson WMA is a favorite spot for hunters and outdoor enthusiasts who enjoy eastern Maryland's bountiful wildlife. Johnson WMA is also the location of the Natural Resource Police lower shore eastern.                                                                                                                            </p><p></p><p>From U.S. Route 50, take MD 12 southeast to Johnson Road east to Mt. Olive Road and Johnson WMA. Alternately, take Mt. Hermon Road (MD 350) east to Airport Road south to Johnson Road east to Mt. Olive Road. Vehicle access: via marked parking areas located off Mt. Olive Road.                                                          For additional information, contact the Wellington Wildlife Office at (410) 543-8223.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.hmdb.org/marker.asp?marker=4388\nhttp://www.dnr.state.md.us/wildlife/Publiclands/eastern/johnson.asp","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/johnsonSchoolHouse.jpg","Data Source":"","id":67,"uri":"Johnson%20School-House%20Game%20Refuge","photos":["http://apps.esrgc.org/scenicbyway/img/johnsonSchoolHouse.jpg"],"websites":["http://www.hmdb.org/marker.asp?marker=4388","http://www.dnr.state.md.us/wildlife/Publiclands/eastern/johnson.asp"]},{"Name":"Kilburnie Playground","Category":"Recreational","StreetAddress1":"Dundee Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21804","location":"38.353049, -75.5013989","Description":"","DescriptionLong":"(2.0 acres park) Kilburnie Playground is a well kept park located off Mt. Hermon Road in the Kilburnie Estates neighborhood. The spacious, shaded park has two tennis courts, a basketball court, a soccer field, a picnic area with grills and tables, and a large playground area. The playground includes two swing sets and a Gametime Playset for school age children with slides and climbing walls. With the playground and picnic area nestled under large shade trees, it is an ideal spot for families looking for an easy outing on hot summer days. The equipment is well suited for children of varying ages and the tennis courts, basketball courts, and soccer field provide an activity for older children and adults. Kilburnie Playground is one of just a few parks on this side of town, making it especially convenient for families living in the surrounding neighborhoods. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/kilbirnie-playground.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Kilburnie Playground 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Kilburnie Playground 2.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Kilburnie Playground 3.jpg","Data Source":"","id":68,"uri":"Kilburnie%20Playground","photos":["http://apps.esrgc.org/scenicbyway/img/Kilburnie Playground 1.jpg","http://apps.esrgc.org/scenicbyway/img/Kilburnie Playground 2.jpg","http://apps.esrgc.org/scenicbyway/img/Kilburnie Playground 3.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/kilbirnie-playground.html"]},{"Name":"Lake Street Playground","Category":"Recreational","StreetAddress1":"710 Lake Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.3758596, -75.60332489","Description":"","DescriptionLong":"(4.4 acres park) The Lake Street Playground is located right across the street from Chipman Elementary School and shares a parking lot with the First Baptist Church Family Life and Cultural Center. The well-maintained neighborhood park has a recreational softball field, two lighted basketball courts with bleachers, a large playground area, a pavilion with picnic tables and grills, and a permanent concessions building with restroom facilities. The playground equipment includes a Gametime play set for school age children with a climbing wall and 6 slides. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/lake-street-playground.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Lake Street Playground 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Lake Street Playground 2.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Lake Street Playground 3.jpg","Data Source":"","id":69,"uri":"Lake%20Street%20Playground","photos":["http://apps.esrgc.org/scenicbyway/img/Lake Street Playground 1.jpg","http://apps.esrgc.org/scenicbyway/img/Lake Street Playground 2.jpg","http://apps.esrgc.org/scenicbyway/img/Lake Street Playground 3.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/lake-street-playground.html"]},{"Name":"Leonards Mill Park and Public Water Access","Category":"Recreational/Hiking and Biking Trails/Public Water Access","StreetAddress1":"2848 Leonards Mill Pond Road","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.423118, -75.5665889","Description":"","DescriptionLong":"•  Boating - Motorized Access</p><p>•  Boating - Non-Motorized Access</p><p>•  Kayak/Canoe Put-In</p><p></p><p>9.8 acres. Route 13 North in Salisbury is mostly known for its shopping and restaurant chains. However, just past the entrance to Chile’s is Leonard's Mill Park, a little oasis amidst the hustle and bustle. Visitors can access the park in two ways, via the entrance on Leonard's Mill Pond Road or through the Wicomico County Welcome Center parking lot. The beautiful park is divided in the middle by a small creek leading to Leonard Pond. Two bridges, ideal for fishing, connect the upper and lower sides of the park.    On the upper side there is a boat ramp with access to Leonard Pond, a large pavilion with a grill and picnic tables, a horseshoe pit, and a recreational softball field. On the lower side there is a large playground area, picnic tables, and a walking trail. The well shaded playground area includes a large Gametime play set with slides, climbing equipment, and monkey bars. </p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/leonards-mill-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/leonardsMillWaterAccess.jpg","Data Source":"","id":70,"uri":"Leonards%20Mill%20Park%20and%20Public%20Water%20Access","photos":["http://apps.esrgc.org/scenicbyway/img/leonardsMillWaterAccess.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/leonards-mill-park.html"]},{"Name":"Lower Wicomico River Greenways","Category":"Recreational","StreetAddress1":"","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"","location":"","Description":"","DescriptionLong":"The Wicomico River Greenways is an existing wildlife corridor along the Wicomico River. Tidal wetlands surround much of the river, although a large stretch (White Haven to Salisbury) has been heavily developed in past years. The river still serves as a major waterfowl corridor, and nearly 3,000 acres of land are protected at Pemberton Historical Park at the eastern end and by Ellis Bay Wildlife Management Area at the southwest end of the","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.dnr.state.md.us/greenways/counties/wicomico.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":71,"uri":"Lower%20Wicomico%20River%20Greenways","photos":[],"websites":["http://www.dnr.state.md.us/greenways/counties/wicomico.html"]},{"Name":"Mardela Boat Ramp","Category":"Recreational/Public Water Access","StreetAddress1":"500 Bridge Street","City":"Mardela Springs","County":"Wicomico","State":"MD","Zip":"21837","location":"38.4540881, -75.7558443","Description":"","DescriptionLong":"•  Boating - Motorized Access</p><p>•  Boating - Non-Motorized Access</p><p>•  Kayak/Canoe Put-In</p><p></p><p>0.25 acres. The Mardela Boat Ramp is located on Bridge Street in Mardela Springs, about 15 minutes from Salisbury. The boat ramp provides access to Barren Creek which winds through Mardela Springs, eventually meeting with the Nanticoke River. Barren Creek is a good spot for fishing, kayaking, and canoeing. From the ramp, boaters and paddlers can go under the bridge and follow the creek a few miles through scenic Mardela until reaching Route 50. Going to the left, away from the bridge, leads down a longer winding path towards the Nanticoke River. In either direction, boaters and paddlers are sure to enjoy the scenery and wildlife of the Eastern Shore.</p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/mardela-boat-ramp.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/MardelaBoatRamp.jpg","Data Source":"","id":72,"uri":"Mardela%20Boat%20Ramp","photos":["http://apps.esrgc.org/scenicbyway/img/MardelaBoatRamp.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/mardela-boat-ramp.html"]},{"Name":"Mardela Playground and Ball Park","Category":"Recreational","StreetAddress1":"210 Station Street","City":"Mardela Springs","County":"Wicomico","State":"MD","Zip":"21837","location":"38.4627674, -75.7575569","Description":"","DescriptionLong":"(4.0 acres park) The Mardela Playground and Ball Park is located in the heart of Mardela Springs, Maryland, right next to the Fire Department and Town Hall on Station Street. The community park has a large playground area, a basketball court, a lighted softball field with bleachers, and a pavilion with several picnic tables. The playground area includes a large playset with slides and climbing equipment along with swings and a merry-go-round. The softball field, Raymond E. Robinson Jr. Memorial Ball Park, is home to Mardela’s local youth teams and hosts many games throughout the summer. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/mardela-playground-and-ball-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Mardela Playground and Ball Park 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Mardela Playground and Ball Park 2.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Mardela Playground and Ball Park 3.jpg","Data Source":"","id":73,"uri":"Mardela%20Playground%20and%20Ball%20Park","photos":["http://apps.esrgc.org/scenicbyway/img/Mardela Playground and Ball Park 1.jpg","http://apps.esrgc.org/scenicbyway/img/Mardela Playground and Ball Park 2.jpg","http://apps.esrgc.org/scenicbyway/img/Mardela Playground and Ball Park 3.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/mardela-playground-and-ball-park.html"]},{"Name":"Maryland National Guard Armory Site","Category":"Historic Site","StreetAddress1":"122 South Division Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.364014, -75.600636","Description":"","DescriptionLong":"The National Guard Armory, built 1913-15, once stood at the site of the Wicomico County Library. The library of today, built in the 1960s, incorporates the cellar and portions of the walls of the former armory. The armory structure was made of concrete, brick and stone. ","DateOfSite":"1913-15","NationalRegister":"","MD Inventory":"WI-414","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Maryland National Guard Armory Site 1.jpg","Data Source":"MD Inventory of Historic Properties","id":74,"uri":"Maryland%20National%20Guard%20Armory%20Site","photos":["http://apps.esrgc.org/scenicbyway/img/Maryland National Guard Armory Site 1.jpg"],"websites":[]},{"Name":"Mason Dixon Marker","Category":"Historic Marker","StreetAddress1":"6.5 miles west of Delmar, Del., and 3 miles east of Mardela Springs, Md., along Delaware-Maryland Route 54.","City":"","County":"","State":"","Zip":"","location":"38.46006666666667,-75.69366666666667","Description":"","DescriptionLong":"“A boundary marker, set by Charles Mason and Jeremiah Dixon 217 years ago (1767) to fix the extreme southwest corner of Delaware at the Maryland border. Broken by vandals was reset in October 1985 by officials from Delaware, MD and National Geodetic Survey” *   It is housed in a covered pavilliion surrounded by a steel fence.     </p><p></p><p>“Mason-Dixon Middle Point Marker  Mason and Dixon placed this double Crown Stone at the middle point in 1768 after completing the rest of their survey. It has the Calvert Arms on the south and west sides and the Penn arms on the north and east sides (Calvert arms shown). These markers are carved from oolitic limestone imported from England.” **</p><p>Additionally there is another Mason Dixon stone which was never used but found and kept safe and donated in 2005 to the West Side Historical Society by Mr & Mrs Simpson Dunahoo.  Origianally located at 38° 27.683′ N, 75° 45.125′ W.  The stone has since vanished being taken by vandals. </p><p>","DateOfSite":"1768","NationalRegister":"","MD Inventory":"Historical Marker Database","In Historic District":"","MD Military Monuments":"","Website":"http://www.hmdb.org/Marker.asp?Marker=74130","Website addl":"**http://www.hmdb.org/Marker.asp?Marker=74130","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/MasonDixonMarker1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/MasonDixonMarker2.jpg","Data Source":"","id":75,"uri":"Mason%20Dixon%20Marker","photos":["http://apps.esrgc.org/scenicbyway/img/MasonDixonMarker1.jpg","http://apps.esrgc.org/scenicbyway/img/MasonDixonMarker2.jpg"],"websites":["http://www.hmdb.org/Marker.asp?Marker=74130"]},{"Name":"Mason Dixon Sports Complex","Category":"Recreational","StreetAddress1":"704 South Pennsylvania Avenue","City":"Delmar","County":"Wicomico","State":"MD","Zip":"21875","location":"38.4495226, -75.578560","Description":"","DescriptionLong":"(13.0 acres park) The Mason-Dixon Sports Complex is just down the street from Gordy Park and around the corner from Delmar Elementary School. The large complex has four ball fields along with lights, electronic scoreboards, bleachers, and a concessions building. During the spring and summer, the park hosts games for Delmar Little League Girl’s Softball as well as Wicomico County Men’s Softball. The Delmar Little League Softball Field has been named after George Leong, a community member recognized for his lifelong dedication to the youth of Delmar. In addition to the ball fields, the complex has a well shaded playground area with a pavilion and picnic tables. This provides a nice area for families with small children to enjoy the games. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/mason-dixon-sports-complex.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Mason Dixon Sports Complex 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Mason Dixon Sports Complex 2.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Mason Dixon Sports Complex 3.jpg","Data Source":"","id":76,"uri":"Mason%20Dixon%20Sports%20Complex","photos":["http://apps.esrgc.org/scenicbyway/img/Mason Dixon Sports Complex 1.jpg","http://apps.esrgc.org/scenicbyway/img/Mason Dixon Sports Complex 2.jpg","http://apps.esrgc.org/scenicbyway/img/Mason Dixon Sports Complex 3.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/mason-dixon-sports-complex.html"]},{"Name":"Masonic Temple,Wicomico Lodge 91","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"110 N Division Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.36592070000556,-75.60064136981964","Description":"","DescriptionLong":" The Masonic Temple is a neoclassical, yellow ochre and red pressed brick façade located directly across from the Courthouse and Old City Hall. There is an arched door and window openings as well as a bold cornice across the top of the third floor point. The Temple was desgined by Baltimore architect Jackson C. Gott and built by a Princess Anne contractor James A McAllen. ","DateOfSite":"1904","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/masonictemple.jpg","Data Source":"Architectural walking tour guide","id":77,"uri":"Masonic%20Temple%2CWicomico%20Lodge%2091","photos":["http://apps.esrgc.org/scenicbyway/img/masonictemple.jpg"],"websites":[]},{"Name":"Merchants Hotel","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"243-245 Main Street","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.365375, -75.603298","Description":"","DescriptionLong":"The distinctive triangular shaped property was known variously as the Merchants' Hotel or the West End Hotel. The building, one of the first constructed after the 1886 fire, was financed by Martin E. and Mary C. Hastings. Two years later they sold the property to Theodore A. Veasey and Peter S. Shockley. By 1899, a grocer and barber divided the first floor space. The building is listed in the Maryland Inventory of Historic Properties (No. WI-146).","DateOfSite":"1887","NationalRegister":"","MD Inventory":"WI-146","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Merchants Hotel 1.JPG","Data Source":"MD Inventory of Historic Properties","id":78,"uri":"Merchants%20Hotel","photos":["http://apps.esrgc.org/scenicbyway/img/Merchants Hotel 1.JPG"],"websites":[]},{"Name":"Mt. Zion One-Room School","Category":"Historic Site","StreetAddress1":"3816 Old Furnace Road","City":"Snow Hill","County":"Worcester","State":"MD","Zip":"21863","location":"38.204726, -75.470823","Description":"","DescriptionLong":"The Mt. Zion One Room School House, recently located in Snow Hill on Ironshire Street and moved to Furnace Town in November of 2015, was built in 1869 near Whiton and used as a school until 1931. It stood empty until Dr. Paul Cooper, Superintendent of Schools, had the building moved to Snow Hill. It was opened to the public in 1964 and has since demonstrated to students and visitors how their forebears were taught in the days of one room schools. The date originally built varies. The date is attributed to around 1868 or 1869. The building is listed in the Maryland Inventory of Historic Properties (No. WO-116) which dates the structure to about 1859.","DateOfSite":"","NationalRegister":"","MD Inventory":"WO-116","In Historic District":"","MD Military Monuments":"","Website":"http://www.worcestermuseums.org/mt-zion-one-room-school.php","Website addl":"","Additional Information":"","Photo":"","Data Source":"MD Inventory of Historic Properties and website","id":79,"uri":"Mt.%20Zion%20One-Room%20School","photos":[],"websites":["http://www.worcestermuseums.org/mt-zion-one-room-school.php"]},{"Name":"Nabb Research and Genelogy Center","Category":"Points of Interest","StreetAddress1":"Wayne and Power Streets","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21804","location":"38.339851, -75.601299","Description":"","DescriptionLong":"A popular repository for family journals and papers, surveyors' and civil engineers' papers, maps, research notes of local historians, book and pamphlet collections, business records, and other ephemera. </p><p>The mission of the Nabb Research Center is to cultivate and sustain the advancement of scholarly research through collecting, preserving, disseminating and providing access to records and artifacts which illustrate the rich historical and cultural heritage of the greater Delmarva region.  As part of its mission, the Nabb Research Center also:   introduces students, potential students and other interested persons to the vast historical, archeological and cultural heritage of Delmarva / offers students a strong foundation in a variety of specialized studies in history, folklore and related fields / serves as a foundation for life-long learning and research / provides opportunities for interaction with the local and national community of researchers, educators, business leaders, family historians and others interested in Delmarva history and culture                 </p><p></p><p>History: In 1982, when faculty members Dr. Ray Thompson and Sylvia Bradley decided that history was too important to be taught specifically for secondary education, the primary goal for most history majors at the time, they took measures in their own hands and started a research center for the use of all students. Recognizing that historical land records, inventories and wills dating back to earliest colonial days were contained in as many as 36 different repositories scattered throughout the peninsula, Dr. Ray Thompson and Sylvia Bradley initiated an ambitious program of microfilm acquisition, which was generously and enthusiastically supported by local researchers and family historians. Thus, the Archives Center (as the Nabb Center was formerly called) was born</p><p>","DateOfSite":"1982","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://nabbhistory.salisbury.edu/","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Nabb Research Center 1.JPG","Data Source":"","id":80,"uri":"Nabb%20Research%20and%20Genelogy%20Center","photos":["http://apps.esrgc.org/scenicbyway/img/Nabb Research Center 1.JPG"],"websites":["http://nabbhistory.salisbury.edu/"]},{"Name":"Nanticoke Harbor Public Water Access","Category":"Recreational/Public Water Access","StreetAddress1":"20411 West Harbor Road","City":"Nanticoke","County":"Wicomico","State":"MD","Zip":"21840","location":"38.270242, -75.9093149","Description":"","DescriptionLong":"•  Boating - Motorized Access</p><p>•  Boating - Non-Motorized Access</p><p>•  Boat Slips</p><p>•  Kayak/Canoe Put-In</p><p></p><p>6.5 acres. Nanticoke Harbor is located about 20 miles from Salisbury, Maryland via Nanticoke Road. Home to both commercial and recreational boaters, Nanticoke Harbor provides two boat ramps, a loading ramp, and 68 boat slips along the scenic Nanticoke River. There is also a pavilion situated on the water’s edge and a secluded beach area perfect for fishing.     A $1.6 million dredging and restoration project was completed at the harbor in the spring of 2011. The project was funded by the DNR Waterway Improvement Fund and included dredging of the harbor’s shallow channel along with the repair of two existing stone jetties. </p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/nanticoke-harbor.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/NanticokeHarbor.jpg","Data Source":"","id":81,"uri":"Nanticoke%20Harbor%20Public%20Water%20Access","photos":["http://apps.esrgc.org/scenicbyway/img/NanticokeHarbor.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/nanticoke-harbor.html"]},{"Name":"Nanticoke River Water Trail","Category":"Recreational","StreetAddress1":"","City":"","County":"Wicomico","State":"MD","Zip":"","location":"","Description":"","DescriptionLong":"The Nanticoke River Water Trail is a potential system of water trails along the Nanticoke River and its tributaries in western Wicomico County. The Nanticoke River serves as the spine of the system. Other potential water trail routes in the system include Barren Creek, Rewastico Creek, Quantico Creek, and Qetipquin Creek. The Nanticoke River Water Trail could eventually tie into the routes of other water trails originating in Dorchester County including Marshyhope Creek and Fishing Bay.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.dnr.state.md.us/greenways/counties/wicomico.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":82,"uri":"Nanticoke%20River%20Water%20Trail","photos":[],"websites":["http://www.dnr.state.md.us/greenways/counties/wicomico.html"]},{"Name":"Nassawango Creek Preserve(ecological greenways)","Category":"Recreational","StreetAddress1":"","City":"","County":"Wicomico","State":"MD","Zip":"","location":"","Description":"","DescriptionLong":"The Nassawango Creek Preserve is a partially established greenways along the Nassawango Creek. The Nature Conservancy owns about 3,636 acres along the Nassawango in Wicomico and Worcester counties. In Wicomico County, the Wicomico State Forest provides additional preserved land along the creek. This corridor serves environmental protection purposes by providing habitat for plants and animals and also protects water quality in the creek, which is home to some of the northernmost bald cypress forests in the country. The preserve also harbors at least 14 species of orchids and more than 14 species of warblers, including the striking prothonotary, which raise their young in the dense swamp. Seaside alder (Alnus maritima), although abundant locally, is rare nationally. </p><p></p><p>An on-site visitor center is now open and will soon house permanent exhibits highlighting Nassawango Creek’s natural significance. The preserve’s two easy hiking trails, the Paul Leifer and Nassawango Joe trails, traverse upland woods, bald cypress swamps, and a canal dug in the 1800’s. Nassawango Creek also can be experienced via canoe from a put-in at Red House Road.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.dnr.state.md.us/greenways/counties/wicomico.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":83,"uri":"Nassawango%20Creek%20Preserve(ecological%20greenways)","photos":[],"websites":["http://www.dnr.state.md.us/greenways/counties/wicomico.html"]},{"Name":"Nassawango Iron Furnace","Category":"Historic Site","StreetAddress1":"3816 Old Furnace Road","City":"Snow Hill","County":"Worcester","State":"MD","Zip":"21863","location":"38.204165, -75.469408","Description":"","DescriptionLong":"The furnace at Furnace Town, called the Nassawango or Naseongo Furnace, was erected in 1830 at the site in of a grist and saw mill on 2,000 acres of land on Nassawango Creek. The land was formerly owned by Elijah Coulbourne, and was offered for sale specifically for the iron contained in its soil (Snow Hill Messenger Dec. 13, 1831). The land was purchased by the Maryland Iron Company, which had been formed in 1828 by the Maryland Legislature (A Bill). The new owners completed construction of the furnace stack by the spring of 1832 (Snow Hill Messenger May 21, 1832), only a few months after their purchase. Upon the completion of the furnace stack, the Maryland Iron Company purchased an additional 5,000 acres of land surrounding the original holding, and began the manufacture of iron. The building is listed in the Maryland Inventory of Historic Properties (No. WO-10) which describes it as the only furnace in Maryland ever to make extensive use of bog ore, producing about 700 tons of iron per year operated until 1849.</p><p></p><p>Furnace Town and its Nassawango Iron Furnace (recognized by The American Society of Mechanical Engineers as a National Historic Mechanical Engineering Landmark) comprise an educational site of local archaeological and historical interest. The furnace and buildings are being restored, preserved and interpreted by Furnace Town Foundation, Inc.","DateOfSite":"","NationalRegister":"","MD Inventory":"WO-10","In Historic District":"","MD Military Monuments":"","Website":"http://www.furnacetown.com/","Website addl":"http://www.worcestermuseums.org/furnace-town.php","Additional Information":"","Photo":"","Data Source":"","id":84,"uri":"Nassawango%20Iron%20Furnace","photos":[],"websites":["http://www.furnacetown.com/"]},{"Name":"Newtown Historic Marker","Category":"Historic Marker/Historic Site","StreetAddress1":"N. Division Street 0.1 miles south of W. Chestnut St., on the right when traveling north.","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21802","location":"38.36783333333333, -75.6002","Description":"","DescriptionLong":"Established by ordinance in 1975, Newtown is distinguished by residential reconstruction after the two severe fires in 1860 and 1886. The district contains fine Victorian architecture and a notable example of the Federal period. Poplar Hill Mansion, circa 1800, oldest surviving building in Salisbury.</p><p>Erected by The Newtown Association, Inc. and Maryland Historical Society.</p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.hmdb.org/marker.asp?marker=3835","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Newtown Historic Marker 1.JPG","Data Source":"","id":85,"uri":"Newtown%20Historic%20Marker","photos":["http://apps.esrgc.org/scenicbyway/img/Newtown Historic Marker 1.JPG"],"websites":["http://www.hmdb.org/marker.asp?marker=3835"]},{"Name":"Nick Meyer Park","Category":"Recreational","StreetAddress1":"201 West Fairfield","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21804","location":"38.370418, -75.56527249","Description":"","DescriptionLong":"(5.0 acres park) Nick Meyer Park is located just a few blocks from Civic Avenue on the east side of Route 50 in Salisbury, Maryland. The spacious and well-shaded neighborhood park has a large playground area, a basketball court, a softball field with bleachers, two tennis courts, and a pavilion with picnic tables and a grill. The tennis courts received a facelift in 2009 with new paint and lines and the basketball court and softball field are well maintained. The playground area includes a playset with several slides along with swings and riding toys. Nick Meyer Park is a great place to drop by for some family time on the playground or a pick-up game with friends. Being within walking distance for many east side neighborhoods, this park is a great resource for local kids and families. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/nick-meyer-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Nick Meyer Park 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Nick Meyer Park 2.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Nick Meyer Park 3.jpg","Data Source":"","id":86,"uri":"Nick%20Meyer%20Park","photos":["http://apps.esrgc.org/scenicbyway/img/Nick Meyer Park 1.jpg","http://apps.esrgc.org/scenicbyway/img/Nick Meyer Park 2.jpg","http://apps.esrgc.org/scenicbyway/img/Nick Meyer Park 3.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/nick-meyer-park.html"]},{"Name":"Old City Hall and Firehouse","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"110 Church Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.366087, -75.601054","Description":"","DescriptionLong":"This distinctive structure served as the old City Hall and as a firehouse. In 1896, the city council purchased the property known as the \"Tracy lot\" from George C. Hill for construction of a combination city hall and firehouse, with the first floor used as the firehouse. The city council and fire department shared the building until 1928 when the new firehouse was erected on South Division Street. The city council expanded the building with a brick addition around 1952. The building is listed in the Maryland Inventory of Historic Properties (No. WI-74).</p><p>","DateOfSite":"1896","NationalRegister":"","MD Inventory":"WI-74","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Old City Hall and Firehouse 1.jpg","Data Source":"MD Inventory of Historic Properties","id":87,"uri":"Old%20City%20Hall%20and%20Firehouse","photos":["http://apps.esrgc.org/scenicbyway/img/Old City Hall and Firehouse 1.jpg"],"websites":[]},{"Name":"Old Salisbury City Fire Hall Headquarters","Category":"Historic Site","StreetAddress1":"S Division St located across from public library","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.364276119491755,-75.60018002986908","Description":"","DescriptionLong":"Originally known as Firehouse #1 was built at cost in 1927 for $50,000, Building of 2 floors with basement. The first floor housed the equipment, the second floor housed the volunteers and chief’s quarters and basement used to dry fire hoses. The building is neoclassical four-bay built with brick and concrete. Parapet wall encircles the roof with a decorative crest featuring the capital letter S. The roof shingles were green tiles.","DateOfSite":"1927","NationalRegister":"no","MD Inventory":"no","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://www.onesalisbury.com/uploads/3/7/6/3/3763176/9893823_orig.jpg","Data Source":"“at the crossroads” paul tourart book page 589","id":88,"uri":"Old%20Salisbury%20City%20Fire%20Hall%20Headquarters","photos":["http://www.onesalisbury.com/uploads/3/7/6/3/3763176/9893823_orig.jpg"],"websites":[]},{"Name":"Old Spring Hill St. Pauls Church Historic Marker","Category":"Historic Marker/Historic Site","StreetAddress1":"Marker is at the intersection of Ocean Gateway (U.S. 50) and Main Street (Maryland Route 347)","City":"Hebron","County":"Wicomico","State":"MD","Zip":"","location":"38.429966666666665, -75.67378333333333","Description":"","DescriptionLong":"Established here between 1711 and 1725 as a chapel of ease for Green Hill Church (1694) located 8 miles south on the Wicomico River. The present ediface was completed in 1773 to replace the original structure. Some of the original furnishings still in use.</p><p>Church building was destroyed by fire July 2014.","DateOfSite":"","NationalRegister":"","MD Inventory":"Erected by Maryland Historical Society","In Historic District":"","MD Military Monuments":"","Website":"http://www.hmdb.org/Marker.asp?Marker=3842","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Old Spring Hill Church historic marker 1.jpg","Data Source":"","id":89,"uri":"Old%20Spring%20Hill%20St.%20Pauls%20Church%20Historic%20Marker","photos":["http://apps.esrgc.org/scenicbyway/img/Old Spring Hill Church historic marker 1.jpg"],"websites":["http://www.hmdb.org/Marker.asp?Marker=3842"]},{"Name":"Old Spring Hill St. Pauls Church Site","Category":"Historic Site","StreetAddress1":"U.S. Rt. 50 and Memory Garden Lane","City":"Hebron","County":"Wicomico","State":"MD","Zip":"","location":"38.430055, -75.672880","Description":"","DescriptionLong":"The distinctive structure of the Spring Hill St. Paul Church was destroyed by fire in 2014. Established here between 1711 and 1725 as a chapel of ease for Green Hill Church (1694) located 8 miles south on the Wicomico River. The 1770s chuch was the second structure to stand in this general location. A previous chapel, erected in the early years of the 18th century, was one of six congregations served by Rev. Alexander Adams, rector of Stepney Parish between 1704 and his death in 1769.","DateOfSite":"1771-1773","NationalRegister":"","MD Inventory":"WI-6","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Old Spring Hill Church St Paul 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/OldSpringChurch1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/OldSpringChurch2.jpg","Data Source":"MD Inventory of Historic Properties","id":90,"uri":"Old%20Spring%20Hill%20St.%20Pauls%20Church%20Site","photos":["http://apps.esrgc.org/scenicbyway/img/Old Spring Hill Church St Paul 1.jpg","http://apps.esrgc.org/scenicbyway/img/OldSpringChurch1.jpg","http://apps.esrgc.org/scenicbyway/img/OldSpringChurch2.jpg"],"websites":[]},{"Name":"Park Bivalve Wharf","Category":"Recreational","StreetAddress1":"Park Bivalve Wharf","City":"Bivalve","County":"Wicomico","State":"MD","Zip":"21814","location":"38.3064742, -75.8918039","Description":"","DescriptionLong":"Bivalve Wharf is located in the town of Bivalve, about 20 minutes from Salisbury via Nanticoke Road. Just past the Westside Fire Department is Bivalve Wharf Road and at the end of the street is a fishing pier known as Bivalve Wharf. The narrow pier extends out into the Nanticoke River and is frequently used by locals for fishing and crabbing. Types of fish commonly caught in the river include perch, pickerel, catfish, largemouth bass, and rockfish (striped bass). So pack up your rod and reel and head down to Bivalve Wharf next time you’re looking for a good fishing spot. There is no public water let off for boats or kayaks or canoe","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/bivalve-wharf.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":91,"uri":"Park%20Bivalve%20Wharf","photos":[],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/bivalve-wharf.html"]},{"Name":"Parson’s Cemetery","Category":"Historic Site","StreetAddress1":"907 N Division Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.374716666666664, -75.59445","Description":"","DescriptionLong":"The land for the original portion of the cemetery was bequeathed by Benjamin Parsons to Saint Peter's Protestant Episcopal Church. The first plat was recorded in 1873 showing the location of the burial plot of the Parsons Family. Additional lands have been added through the years by the vestry of Salisbury Parish, who are responsible for the perpetual care of the cemetery.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.historicalmarkerproject.com/markers/HMUFK_parsons-cemetery_Salisbury-MD.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Parsons Cemetery 1.JPG\nhttp://apps.esrgc.org/scenicbyway/img/Parsons Cemetery 2.JPG","Data Source":"","id":92,"uri":"Parson%E2%80%99s%20Cemetery","photos":["http://apps.esrgc.org/scenicbyway/img/Parsons Cemetery 1.JPG","http://apps.esrgc.org/scenicbyway/img/Parsons Cemetery 2.JPG"],"websites":["http://www.historicalmarkerproject.com/markers/HMUFK_parsons-cemetery_Salisbury-MD.html"]},{"Name":"Pemberton Hall","Category":"Historic Site","StreetAddress1":"5561 Plantation Lane","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.347728,-75.644573","Description":"","DescriptionLong":"Pemberton Hall is an outstanding example of eighteenth century Eastern Shore regional architecture.  This gambrel-roofed brick structure was built by Isaac and Anne Handy in 1741.                                                  The building has been fully restored to its eighteenth century appearance. The restoration is based on extensive and on-going research. The attached 1786 kitchen was reconstructed on its original foundations. Furnishings are based on three eighteenth century probate inventories taken on the plantation.                                                                              After the plantation house became derelict and threatened with destruction, the Pemberton Hall Foundation, Inc. was formed to restore and interpret this important vestige of  Chesapeake Bay regional heritage. The Hall and two acres are owned and maintained by the Foundation.  Pemberton Hall is surrounded by 262-acre Pemberton Historical Park, which maintains three of the original plantation boundaries of 1750.     Pemberton Hall is open for tours by appointment.","DateOfSite":"1741","NationalRegister":"1971 WI -1","MD Inventory":"","In Historic District":"no","MD Military Monuments":"","Website":"http://www.pembertonhall.org/ \nhttp://en.wikipedia.org/wiki/Pemberton_Hall_%28Salisbury,_Maryland%29","Website addl":"http://en.wikipedia.org/wiki/Pemberton_Hall_%28Salisbury,_Maryland%29","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/pembertonHall1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/pembertonHall2.jpg","Data Source":"","id":93,"uri":"Pemberton%20Hall","photos":["http://apps.esrgc.org/scenicbyway/img/pembertonHall1.jpg","http://apps.esrgc.org/scenicbyway/img/pembertonHall2.jpg"],"websites":["http://www.pembertonhall.org/ ","http://en.wikipedia.org/wiki/Pemberton_Hall_%28Salisbury,_Maryland%29"]},{"Name":"Pemberton Historical Park (trail and public water access)","Category":"Recreational/Hiking and Biking Trails","StreetAddress1":"5561 Plantation Lane","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.347415, -75.6430967","Description":"","DescriptionLong":"Pemberton Historical Park is a gorgeous, 260 acre expanse of nature and wildlife, incredibly located just minutes from Route 50 along Pemberton Drive. Created by the Wicomico County Department of Recreation, Parks and Tourism in the 1980’s, the park surrounds Pemberton Hall which is a plantation home built in 1741 and rich in Eastern Shore history. Appropriately, the park’s mission is to provide a setting that blends together both history and the natural environment. This unique combination makes the park suitable for all types of visitors. Amenities include a nature trail system with 7 unique trails ranging from .2 to 1.1 miles, fresh water ponds with fishing allowed on a catch and release basis, public restrooms, and several picnic areas. The park also offers environmental education and nature programs led by the on-site Park Naturalist. Programs are designed for both school groups and the public. Examples of some popular nature programs open to the public include Star Gazers, Cane Poles and Fishing Holes, and Summer Nature Camp (open to children ages 4 – 14). Additionally, public tours and history programs are offered at Pemberton Hall by the Pemberton Hall Foundation. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/pemberton-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Pemberton Historical Park 1.jpg","Data Source":"","id":94,"uri":"Pemberton%20Historical%20Park%20(trail%20and%20public%20water%20access)","photos":["http://apps.esrgc.org/scenicbyway/img/Pemberton Historical Park 1.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/pemberton-park.html"]},{"Name":"Pittsville Ballpark and Playground","Category":"Recreational","StreetAddress1":"34331 Main Street","City":"Pittsville","County":"Wicomico","State":"MD","Zip":"21850","location":"38.3919939, -75.420053","Description":"","DescriptionLong":"(5.0 acres park) Located in the heart of Pittsville, Maryland right next to the Elementary School is the Pittsville Ballpark and Playground. Two entrances provide easy access to different areas of the park. The one on Main Street provides access to the lighted softball field and two soccer fields. The entrance on Rt. 353 by the school provides access to the playground and basketball courts. The large playground area includes a playset with several slides, swings, monkey bars and climbing equipment. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/pittsville-ballpark-and-playground.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Pittsville Ballpark and Playground 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Pittsville Ballpark and Playground 2.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Pittsville Ballpark and Playground 3.jpg","Data Source":"","id":95,"uri":"Pittsville%20Ballpark%20and%20Playground","photos":["http://apps.esrgc.org/scenicbyway/img/Pittsville Ballpark and Playground 1.jpg","http://apps.esrgc.org/scenicbyway/img/Pittsville Ballpark and Playground 2.jpg","http://apps.esrgc.org/scenicbyway/img/Pittsville Ballpark and Playground 3.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/pittsville-ballpark-and-playground.html"]},{"Name":"Pocomoke River Water Trail (water trail)","Category":"Recreational","StreetAddress1":"","City":"","County":"Wicomico","State":"MD","Zip":"","location":"","Description":"","DescriptionLong":"The Pocomoke River Water Trail is a potential water trail route on the Pocomoke River in western Wicomico County. The water trail will tie into the emerging water trail system in Worcester County, which includes the Bogiron Water Trail along Nassawango Creek and the lower Pocomoke River.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.dnr.state.md.us/greenways/counties/wicomico.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":96,"uri":"Pocomoke%20River%20Water%20Trail%20(water%20trail)","photos":[],"websites":["http://www.dnr.state.md.us/greenways/counties/wicomico.html"]},{"Name":"Poplar Hill Mansion","Category":"Historic Site/Maryland Historical Trust/Heritage Tourism","StreetAddress1":"117 Elizabeth Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.371516, -75.595709","Description":"","DescriptionLong":"Open to the public for tours, Poplar Hill Mansion is the only early dwelling of architectural significance to have survived the devastating fires of 1860 and 1886 in Salisbury.          Poplar Hill Mansion was built in 1795-96 as the manor house of a farm outside the small eighteenth century town of Salisbury from a port landing site at the head of the Wicomico River, more than a half mile away.  Construction was begun by Major Levin Handy, originally from Newport, Rhode Island. In 1795 the Major took out a deed for 357 acres of the original 700 acre land patent called \"Pembertons Good Will.\" The house Handy began in 1795-96 was an ambitious Federal-style structure, outdistancing most buildings in the area in size and fine detail. The house was still incomplete.                         In 1805 the title was passed to a prominent physician in Salisbury, Dr. John Huston. When the Doctor died in 1828 there were fruit trees, vegetable crops, sheep, cattle, and eighteen slaves on the property, as well as $110 \"cash on hand.\" Huston's widow Sarah inherited the property. In the late 1840s to early 1850s, she partially subdivided it, overseeing the laying out of Poplar Hill Avenue and Isabella Street. The subdivision of \"Poplar Farm\" continued at a moderate rate before the Civil War. From the 1870s until World War One, the extended area experienced a building boom, creating Salisbury's first suburb, or \"Newtown.\" Mrs. Huston left Poplar Hill to her daughter Elizabeth. Elizabeth initiated its sale to George Waller in 1881. (Elizabeth and her sister Isabella are commemorated in the names of neighborhood streets.)  George Waller and his family lived in the house from 1882 to 1945. Various early photos and memorabilia belonging to the Wallers are located in the Mansion’s archives.                                  Fred A. Adkins, who purchased the property in 1945, undertook restoration work with the hope of turning the house into the local Masonic Lodge. In 1948, when this failed to materialize, the house passed to Mr. and Mrs. Ward A. Garber, who maintained an 18th century period antique shop downstairs and lived upstairs. Mrs. Garber sold the property to Wicomico County in 1970 and since 1974 the City of Salisbury has owned it since as a house museum.","DateOfSite":"1795","NationalRegister":"1971","MD Inventory":"1996 WI8","In Historic District":"yes","MD Military Monuments":"","Website":"http://www.poplarhillmansion.org\nhttp://en.wikipedia.org/wiki/Poplar_Hill_Mansion\nhttp://mht.maryland.gov/nr/NRDetail.aspx?HDID=58&COUNTY =Wicomico&FROM=NRCountyList.aspx?COUNTY=Wicomico ","Website addl":"http://mht.maryland.gov/nr/NRDetail.aspx?HDID=58&COUNTY =Wicomico&FROM=NRCountyList.aspx?COUNTY=Wicomico ","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/poplar hill mansion 1.JPG\nhttp://apps.esrgc.org/scenicbyway/img/poplarHillMansion.jpg","Data Source":"","id":97,"uri":"Poplar%20Hill%20Mansion","photos":["http://apps.esrgc.org/scenicbyway/img/poplar hill mansion 1.JPG","http://apps.esrgc.org/scenicbyway/img/poplarHillMansion.jpg"],"websites":["http://www.poplarhillmansion.org","http://en.wikipedia.org/wiki/Poplar_Hill_Mansion","http://mht.maryland.gov/nr/NRDetail.aspx?HDID=58&COUNTY =Wicomico&FROM=NRCountyList.aspx?COUNTY=Wicomico "]},{"Name":"Port Exchange Building","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"Mill Street and Main St","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"","location":"38.365018, -75.603923","Description":"","DescriptionLong":"*Built in stages shortly after the Great Fire in 1886. Originally was used for a retail grocery. Also on property was a large coal yard, stable, a fertilizer factory, an office, and stables. The building was owned by Turner Bros Wholesale Grocers and then sold to Delmarva Hardward Corp until 1965. Currently houses office various offices overlooking the Wicomico River.","DateOfSite":"1886, 1905","NationalRegister":"","MD Inventory":"WI-268","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"*At the Crossroads  Paul Tourart book","Photo":"http://apps.esrgc.org/scenicbyway/img/Port Exchange Building 1.JPG","Data Source":"","id":98,"uri":"Port%20Exchange%20Building","photos":["http://apps.esrgc.org/scenicbyway/img/Port Exchange Building 1.JPG"],"websites":[]},{"Name":"Port of Salisbury Marina ","Category":"Fuel and Pump Out Stations","StreetAddress1":"506 West Main Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.3640847400482, -75.60727179050446","Description":"","DescriptionLong":"Phone #: (410) 548-3176 </p><p></p><p>Open Tue-Wed (2-6pm) Thur-Sun (9am-4pm)","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.waterwayguide.com/marina/port-of-salisbury-marina","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/portofsalisbury.jpg","Data Source":"","id":99,"uri":"Port%20of%20Salisbury%20Marina%20","photos":["http://apps.esrgc.org/scenicbyway/img/portofsalisbury.jpg"],"websites":["http://www.waterwayguide.com/marina/port-of-salisbury-marina"]},{"Name":"Princess Anne Jail and Police Station","Category":"Historic Site","StreetAddress1":"11780 Beckford Avenue","City":"Princess Anne","County":"Somerset","State":"MD","Zip":"21853","location":"38.204759, -75.695706","Description":"","DescriptionLong":"This structure, now operating as the Princess Anne Police Station, was once known as the \"Grey Eagle\" and built 1857-58. It is the only load-bearing stone walled structure in the county; the granite is believed to have been imported from quarries at Port Deposit in Cecil County.  The structure operated as the Somerset County Jail from 1857 to 1987, when the current facility in Westover was completed. After that time, the building was shared by the town of Princess Anne and the Police Department. In 1999, the town of Princess Anne considered demolishing the building due to the condition of the building. However, Town Commissioners voted to restore the structure, and with the help of the Maryland Historical Trust, the Somerset County Historical Trust, the USDA, and numerous other grants; construction began in 2003. The restored building includes a few exhibits. The historic portions of the building are opened to the public periodically throughout the year. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.princessannepolice.com/about-us.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"MD Inventory of Historic Properties, and Princess Anne Police Dept. website","id":100,"uri":"Princess%20Anne%20Jail%20and%20Police%20Station","photos":[],"websites":["http://www.princessannepolice.com/about-us.html"]},{"Name":"R.K. Truitt Building","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"235 Main Street","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.365404, -75.603036","Description":"","DescriptionLong":"The R.K. Truitt Building was constructed in the spring following the 1886 fire. By 1888, the building shared space with a drugstore and a clothing, boot, and show store. In 1906 the building was sold at auction and soon after the property was conveyed to Floy T. Watson, the daughter of Daniel and Anne Whealton. The building is best known for Watson's Smoke House which occupied the building for many years. In 1908, the business was described as the \"Smoke House\" operated by Paul E. Watson.  The building is listed in the Maryland Inventory of Historic Properties (No. WI-257).","DateOfSite":"1887","NationalRegister":"","MD Inventory":"WI-257","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/R K Truitt Bldg 1.jpg","Data Source":"MD Inventory of Historic Properties, and the1908 Wicomico News special edition","id":101,"uri":"R.K.%20Truitt%20Building","photos":["http://apps.esrgc.org/scenicbyway/img/R K Truitt Bldg 1.jpg"],"websites":[]},{"Name":"Richardson Building","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"130 Main Street","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.365426, -75.599256","Description":"","DescriptionLong":"Lloyd A. Richardson financed construction of this commercial block around 1921. The 1923 Sanborn Fire Insurance map indicates that the building initially housed an automobile showroom on the first floor and a dance hall above. The building is listed in the Maryland Inventory of Historic Properties (No. WI-584).","DateOfSite":"c.1921","NationalRegister":"","MD Inventory":"WI-584","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Richardson Bldg 1.JPG","Data Source":"MD Inventory of Historic Properties","id":102,"uri":"Richardson%20Building","photos":["http://apps.esrgc.org/scenicbyway/img/Richardson Bldg 1.JPG"],"websites":[]},{"Name":"Riverside boat ramps","Category":"Recreational/Public Water Access","StreetAddress1":"538 Riverside Drive","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.362717, -75.606451","Description":"","DescriptionLong":"Directions MD Route 50 towards Ocean City. Right on Mill Street, slight right onto Riverside Drive. The 2 boat ramps are located at either end of the facility (east and west). Other amenities at the site include a picnic area and fishing pier.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://dnr2.maryland.gov/boating/Pages/water-access/wicomico.aspx\nhttp://webapps02.dnr.state.md.us/MDPublicWaterAccess/ShowWaterAccessToPublic.aspx?PKintKeyID=315","Website addl":"http://webapps02.dnr.state.md.us/MDPublicWaterAccess/ShowWaterAccessToPublic.aspx?PKintKeyID=315","Additional Information":"","Photo":"","Data Source":"","id":103,"uri":"Riverside%20boat%20ramps","photos":[],"websites":["http://dnr2.maryland.gov/boating/Pages/water-access/wicomico.aspx","http://webapps02.dnr.state.md.us/MDPublicWaterAccess/ShowWaterAccessToPublic.aspx?PKintKeyID=315"]},{"Name":"Roaring Point Park and Public Water Access","Category":"Recreational/Public Water Access","StreetAddress1":"2576 Roaring Point Park Drive","City":"Nanticoke","County":"Wicomico","State":"MD","Zip":"21840","location":"38.263458, -75.9128819","Description":"","DescriptionLong":"• Kayak/Canoe Put-In</p><p>• Swimming</p><p></p><p>33 acres.  Roaring Point is a beautiful park tucked quietly away along the Nanticoke River, Maryland, secluded by dense trees and wildlife. The park is located about 30 minutes from Salisbury via Nanticoke Road. A short path through the wooded area leads to a .8 mile stretch of beach with a picturesque view of the lower Nanticoke River as it widens to reach the Tangier Sound and Chesapeake Bay. Acquired through Maryland Program Open Space, the park is owned and maintained by Wicomico County.     Due to its historical and environmental significance, however, many local groups also contribute to the park’s ongoing preservation, including the Friends of the Nanticoke River, the Nanticoke Watershed Alliance, and the Chesapeake Bay Foundation. Roaring Point is well known as a good fishing and crabbing spot by the locals, thanks to its location on the river and its long, rocky jetty that extends far out into the tide. The park is also a good spot for a peaceful walk through the woods or a stroll along the beach","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/roaring-point-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/RoaringPoint.jpg","Data Source":"","id":104,"uri":"Roaring%20Point%20Park%20and%20Public%20Water%20Access","photos":["http://apps.esrgc.org/scenicbyway/img/RoaringPoint.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/roaring-point-park.html"]},{"Name":"Rockawalkin Creek Public Water Access","Category":"Recreational/Public Water Access","StreetAddress1":"","City":"","County":"Wicomico","State":"MD","Zip":"21801","location":"38.355733, -75.673674","Description":"","DescriptionLong":"KAYAKING.</p><p></p><p>Put in at Pemberton Drive and paddle downstream through this beautiful freshwater tributary alongside the Nithsdale neighborhood through a mix of houses and forested bluffs (1.5 hrs).</p><p></p><p>Parking: None (Drop Off/Pick Up), The Nithsdale neighborhood boat ramp is not open to the public","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicoriver.org/rockawalkin-creek.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":105,"uri":"Rockawalkin%20Creek%20Public%20Water%20Access","photos":[],"websites":["http://www.wicomicoriver.org/rockawalkin-creek.html"]},{"Name":"Rockawalkin School","Category":"Historic Site","StreetAddress1":"Pemberton Drive","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.364429, -75.621412","Description":"","DescriptionLong":"The Rockawalkin schoolhouse stands on the grounds of Pemberton Elementary School at the corner of Pemberton Drive and Ellegood Street.Moved to this location in 1973, the school formerly stood near the intersection of Nanticoke Road (MD 349) and Rockawalkin Road. Exterior and interior architectural finishes point to a turn of the 20th century date of construction although the historical marker indicates it was erected around 1872. The basic one-room school was improved upon over the course of the late 19th century. The bank of windows across the east side were introduced to rural schools in an effort to improve natural lighting.","DateOfSite":"c.1900","NationalRegister":"","MD Inventory":"WI-77","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Rockawalkin School 1.jpg","Data Source":"MD Inventory of Historic Properties","id":106,"uri":"Rockawalkin%20School","photos":["http://apps.esrgc.org/scenicbyway/img/Rockawalkin School 1.jpg"],"websites":[]},{"Name":"Rockawalkin School Historical Marker","Category":"Historic Marker/Historic Site","StreetAddress1":" Pemberton Drive","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.364551, -75.621563","Description":"","DescriptionLong":"Rockawalkin School circa 1872. One-room schoolhouse built for the community of Rockawalkin. It held grades 1 through 7, later 1 through 5. Located on northeast corner of Maryland Route 349 and Rockawalkin Road, it was abandoned as a school in 1939, moved to this location, 1973. Wicomico County Historical Society and Maryland Historical Society historic marker.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://mht.maryland.gov/historicalmarkers/Details.aspx?id=RM-818&recNum=0&keyword=Rockawalkin&county=Wicomico%20County","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Rockawalkin School Historic Marker 1.JPG","Data Source":"","id":107,"uri":"Rockawalkin%20School%20Historical%20Marker","photos":["http://apps.esrgc.org/scenicbyway/img/Rockawalkin School Historic Marker 1.JPG"],"websites":["http://mht.maryland.gov/historicalmarkers/Details.aspx?id=RM-818&recNum=0&keyword=Rockawalkin&county=Wicomico%20County"]},{"Name":"Rose Street Boat Ramp","Category":"Recreational/Public Water Access","StreetAddress1":"Rose Street","City":"","County":"Wicomico","State":"MD","Zip":"21801","location":"38.374728, -75.602066","Description":"","DescriptionLong":"Located at Johnson’s Pond. Isabella Street in Salisbury, then make a left onto Lake Street then right onto Rose Street. Gravel parking lot with paved boat ramp.  There is no horsepower limitation for boats on the pond. Camping and swimming are prohibited. At 104 acres in size, Johnson's Pond is the largest impoundment on the Eastern Shore. Maximum depth is 11 feet. amp.  Medium parking available","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://dnr2.maryland.gov/boating/Pages/water-access/wicomico.aspx\nhttp://webapps02.dnr.state.md.us/MDPublicWaterAccess/ShowWaterAccessToPublic.aspx?PKintKeyID=582","Website addl":"http://webapps02.dnr.state.md.us/MDPublicWaterAccess/ShowWaterAccessToPublic.aspx?PKintKeyID=582","Additional Information":"","Photo":"","Data Source":"","id":108,"uri":"Rose%20Street%20Boat%20Ramp","photos":[],"websites":["http://dnr2.maryland.gov/boating/Pages/water-access/wicomico.aspx","http://webapps02.dnr.state.md.us/MDPublicWaterAccess/ShowWaterAccessToPublic.aspx?PKintKeyID=582"]},{"Name":"Salisbury Bandstand","Category":"Historic Site/Recreational/Maryland Historical Trust","StreetAddress1":"City Park East Main St & Snow Hill Road & Park Drive","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21804","location":" 38.364281, -75.591165","Description":"","DescriptionLong":"Approximately built 1934. 80 years old The octagonal bandstand was built along as part of a Great Depression-era work program.  Still actively used every year for seasonal concerts in the park. It is octagonal in shape and supported on raised brick foundation with a green tile roof. It was built in conjunction with the footbridge at City Park","DateOfSite":"1934","NationalRegister":"","MD Inventory":"WI-581","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/bandstand.jpg","Data Source":"MHT MD Inventory of Historic Properties","id":109,"uri":"Salisbury%20Bandstand","photos":["http://apps.esrgc.org/scenicbyway/img/bandstand.jpg"],"websites":[]},{"Name":"Salisbury News & Advertiser Building","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"120-122 Main Street","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.365413, -75.599719","Description":"","DescriptionLong":"The Salisbury News & Advertiser constructed this building around 1918 after acquiring a portion of the Lakeside property on East Main Street from William E. Wailes in July 1917. The newspaper began in 1867 by R. Reese Morgan who partnered with Samuel Q. Parker. Morgan was the son of John Morgan who started Salisbury's first newspaper, The Sentinel in 1859. The building is listed in the Maryland Inventory of Historic Properties (No. WI-585).","DateOfSite":"c.1918","NationalRegister":"","MD Inventory":"WI-585","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Salisbury News and Advertiser Bldg 1.JPG","Data Source":"MD Inventory of Historic Properties","id":110,"uri":"Salisbury%20News%20%26%20Advertiser%20Building","photos":["http://apps.esrgc.org/scenicbyway/img/Salisbury News and Advertiser Bldg 1.JPG"],"websites":[]},{"Name":"Salisbury Plaza","Category":"Historic Site/Heritage Tourism","StreetAddress1":"Downtown","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.365334, -75.601796","Description":"","DescriptionLong":"The Salisbury Downtown Plaza is the center hub of history and current activity. It is a Arts and Entertainment District and is conveniently located off of Salisbury’s two major thoroughfares, Route 13 N/S and Route 50 E/W. There is plenty of on street and off street parking available in Downtown Salisbury. On street parking is metered and short-term. If you need longer term parking, the City offers parking in municipal lots and the parking garage. Available is an architectural walking tour guide from the City of Salisbury, art galleries, shopping and various restaurants, ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.downtownsalisbury.org/\nhttp://www.mainstreetmaryland.org/visit/salisbury/","Website addl":"http://www.mainstreetmaryland.org/visit/salisbury/","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Salisbury Plaza 1.JPG\nhttp://i1236.photobucket.com/albums/ff445/lindaduyer/postcard%20closeup_zpsfs624fro.jpg","Data Source":"","id":111,"uri":"Salisbury%20Plaza","photos":["http://apps.esrgc.org/scenicbyway/img/Salisbury Plaza 1.JPG","http://i1236.photobucket.com/albums/ff445/lindaduyer/postcard%20closeup_zpsfs624fro.jpg"],"websites":["http://www.downtownsalisbury.org/","http://www.mainstreetmaryland.org/visit/salisbury/"]},{"Name":"Salisbury Riverwalk trail","Category":"Recreational/Hiking and Biking Trails","StreetAddress1":"Downtown","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.364723,-75.597450 ","Description":"","DescriptionLong":"(1.0 Mile Trail) Urban walking Trail.  Runs beside downtown Salisbury from Rt 13 until just past Division Street Bridge. Travels along both sides of the Wicomico River. Walking bridge leads over river from downtown to open paved pavillon with stone seats.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":112,"uri":"Salisbury%20Riverwalk%20trail","photos":[],"websites":[]},{"Name":"Salisbury Steamboats","Category":"Historic Site","StreetAddress1":"Near Port of Salisbury","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.364062, -75.607282","Description":"","DescriptionLong":"“One year after the formation of Wicomico County, the Maryland Steamboat Company was formed from the remnants of the Individual Enterprise Line, the previous steamboat company to operate on the Wicomico. Operating from Pier Three on Light Street in Baltimore, the steamboats of the Maryland Steamboat Company made stops at ten different landings on the Wicomico River en-route to Salisbury. Baltimore, Chesapeake and Atlantic Railroad Company purchased the Eastern Shore Steamboat, Salisbury steamboat Enoch Pratt then replaced by the Tivoli, then the Virginia, then the Joppa” </p><p></p><p>“In 1830 a man named George Weems introduced steamboats to the Wicomico River. Weems saw the necessity of steamboat travel to what had become the “thriving community” of Salisbury.  [8] Later that year Weems’ steamboat the Patuxent became the first steamboat to reach Salisbury. The Patuxent began sailing for Salisbury on a regular basis, but the river’s shallow depth and sharp turns at times limited its voyage to Whitehaven, a small fishing community several miles southwest of Salisbury In addition to the shipping of bulk cargo, the Patuxent served as a general store when it came to town. When the Patuxent set out from the Maryland wharf in Baltimore business-minded Weems made sure it was stocked full of merchandise from Baltimore and beyond, which he dealt to consumers on an individual basis. The Patuxent continued to make the trip from Baltimore up the Wicomico on and off over the next few decades, depending on the river’s depth and recent success of crops”* “Although the Patuxent was successful dealing in Salisbury, the difficult travel on the Wicomico’s upper reaches limited other ships to destinations south of Salisbury. In the 1840’s and 50’s steamships such as the Franklin, the Thomas Jefferson, and the Hugh Jenkins found success dealing on the Wicomico at Whitehaven and Shad PointTwo years later, the Wilson Small made its way up the Wicomico to Cotton Patch, a wharf and warehouse located two miles below Salisbury”*” In 1903 the BC&A introduced a new steamboat, the Virginia, to the Wicomico River Route. Departing Baltimore from Pratt Street at 5:00pm Tuesdays, Thursdays, and Saturdays, the Virginia arrived at its steamboat wharf next to the Salisbury Roller Flour Mill at 9:00am the next morning.  [48] “Weather and tide permitting”, the Virginia left Salisbury for Baltimore at noon on Mondays, Wednesdays, and Fridays.  [49] The Virginia, which served Salisbury continuously until 1924”","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://faculty.salisbury.edu/~mllewis/wicomico_river/chapter_two.htm#_","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Salisbury Steamboats 1.jpg","Data Source":"","id":113,"uri":"Salisbury%20Steamboats","photos":["http://apps.esrgc.org/scenicbyway/img/Salisbury Steamboats 1.jpg"],"websites":["http://faculty.salisbury.edu/~mllewis/wicomico_river/chapter_two.htm#_"]},{"Name":"Salisbury Urban Greenways(Ecological & Recreational Greenways)","Category":"Recreational","StreetAddress1":"","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"","location":"","Description":"","DescriptionLong":"The Salisbury Urban Park Greenways is an existing greenways extending in two directions from the city of Salisbury. The corridor begins at River Walk Park in the heart of Salisbury and moves north towards the Wicomico River and Johnson’s Lake. The corridor includes the Port of Salisbury, North Lake Park, Deers Head State Hospital, Northwood Industrial Park, Naylor Mill Park, and Wicomico County Athletic Complex, and ends at Leonards Mill Park. </p><p></p><p>To the southeast, the greenways corridor extends along the Wicomico River and Beaverdam Creek. Beginning at River Walk Park, this branch of the greenways includes Municipal Park, and the Salisbury Zoological Park and ends at Schumaker Park. A proposed bicycle route could link local school properties, Salisbury State University, and the YMCA to this system and to the potential Salisbury-Hebron Rail Trail. </p><p></p><p>This urban greenways provides links to the Wicomico Youth and Civic Center, Wicomico Senior High School, and the Elks Lodge and golf course. The greenways has paths for walking and bicycling, and there are paddle boat facilities on the river. It also has the potential to be expanded to connect to other greenways corridors. </p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.dnr.state.md.us/greenways/counties/wicomico.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":114,"uri":"Salisbury%20Urban%20Greenways(Ecological%20%26%20Recreational%20Greenways)","photos":[],"websites":["http://www.dnr.state.md.us/greenways/counties/wicomico.html"]},{"Name":"Salisbury Zoological Park","Category":"Points of Interest/Animals","StreetAddress1":"755 South Park Drive","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21802","location":"38.36111666666667, -75.58395","Description":"","DescriptionLong":"The Salisbury Zoo, located in Salisbury, Maryland, was founded in 1954 when some animals were placed on permanent exhibition in the City Park. The Zoo’s present form resulted from improvements made in the 1970s. The Zoo now provides naturalistic enclosures for species native to North, Central and South America. The Salisbury Zoo is accredited by the Association of Zoos & Aquariums. The Zoo’s policy is maintained by the Salisbury Zoo Commission, Inc. whose nine members are appointed by the Salisbury City Council. The Zoo is funded in-part by the Salisbury Zoo Commission and by the City of Salisbury. *","DateOfSite":"1954","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.salisburyzoo.org/maryland-salisbury-zoo-us","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":115,"uri":"Salisbury%20Zoological%20Park","photos":[],"websites":["http://www.salisburyzoo.org/maryland-salisbury-zoo-us"]},{"Name":"Salisbury-Hebron Rail Trail ecological greenway","Category":"Recreational","StreetAddress1":"","City":"","County":"Wicomico","State":"MD","Zip":"","location":"","Description":"","DescriptionLong":"The Salisbury-Hebron Rail Trail is a potential rail trail which runs between Salisbury and Hebron. The rail line is currently owned by the state but could be transferred to the county for trail development. An extension to Vienna may also be possible. A utility corridor that branches off the rail line at Mardela Springs and heads northwest to the county’s San Domingo Park and on into Delaware is managed as a wildlife corridor.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.dnr.state.md.us/greenways/counties/wicomico.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":116,"uri":"Salisbury-Hebron%20Rail%20Trail%20ecological%20greenway","photos":[],"websites":["http://www.dnr.state.md.us/greenways/counties/wicomico.html"]},{"Name":"Salisbury/Pocomoke River Greenway","Category":"Recreational","StreetAddress1":"","City":"","County":"Wicomico","State":"MD","Zip":"","location":"","Description":"","DescriptionLong":"The Salisbury/Pocomoke river Greenway is a potential greenway that would provide a protected greenway across the eastern section of the county and link the greenway network in Salisbury to proposed corridors along Nassawango Creek and the Pocomoke river. Between Salisbury and Parsonburg, the corridor would be established by utilizing wetlands and portions of an inactive rail line. If an agreement could be reached to utilize the county’s tax ditch system, the corridor could continue to the Pocomoke River. Local parks along the corridor would provide areas for public access, and the greenway could continue to serve as an excellent wildlife corridor.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.dnr.state.md.us/greenways/wicomico.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":117,"uri":"Salisbury%2FPocomoke%20River%20Greenway","photos":[],"websites":["http://www.dnr.state.md.us/greenways/wicomico.html"]},{"Name":"Samuel H. Evans Building","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"239-241 Main Street","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.365368, -75.603178","Description":"","DescriptionLong":"Samuel H. Evans constructed this building months after the 1886 fire for a store. In 1888, the building was identified as having an ice cream parlor as part of a grocery store on the first floor. The building is listed in the Maryland Inventory of Historic Properties (No. WI-256).","DateOfSite":"1887","NationalRegister":"","MD Inventory":"WI-256","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Samuel H Evans Property 1.jpg","Data Source":"MD Inventory of Historic Properties","id":118,"uri":"Samuel%20H.%20Evans%20Building","photos":["http://apps.esrgc.org/scenicbyway/img/Samuel H Evans Property 1.jpg"],"websites":[]},{"Name":"San Domingo Park","Category":"Recreational","StreetAddress1":"25554 Elzey Brown Loop","City":"Mardela Springs","County":"Wicomico","State":"MD","Zip":"21837","location":"38.50147, -75.7252849","Description":"","DescriptionLong":"(23.0 acres park) San Domingo Park is located on the outskirts of Mardela Springs, Maryland via Sharptown Mardela Springs Road (Route 313). The extremely spacious neighborhood park provides local residents with a beautiful place for family recreation. There is a large pavilion with several picnic tables and grills, a playground area, a recreational softball field, and a basketball court. The playground area is spread out around the pavilion and there is plenty of room for kids to run and play in between the equipment. There is a large playset with slides and climbing equipment, swings, a merry-go-round, and several riding toys. In the middle of the park is the softball field, which is perfect for a round of home-run derby with some friends, and then at the other end of the park is the basketball court. So next time you’re looking for some wide open space to enjoy on a beautiful day, San Domingo Park is the place to be. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/san-domingo-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/San Domingo Park 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/San Domingo Park 2.jpg\nhttp://apps.esrgc.org/scenicbyway/img/San Domingo Park 3.jpg","Data Source":"","id":119,"uri":"San%20Domingo%20Park","photos":["http://apps.esrgc.org/scenicbyway/img/San Domingo Park 1.jpg","http://apps.esrgc.org/scenicbyway/img/San Domingo Park 2.jpg","http://apps.esrgc.org/scenicbyway/img/San Domingo Park 3.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/san-domingo-park.html"]},{"Name":"San Domingo School","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"11526 Old School Road","City":"Sharptown","County":"Wicomico","State":"MD","Zip":"21837","location":"38.5108333333333,-75.72221666666667","Description":"","DescriptionLong":"The San Domingo School, also known as the Sharptown Colored School, was built in 1919 as part of the school-building program by Julius Rosenwald and Booker T. Washington. The four-room school was used for 42 years and was then sold to the trustees for the Sharptown Recreation & Lodge Center, for use as a community center. The structure currently serves the</p><p>community as a meeting place for nearly a dozen local organizations.</p><p>The Rosenwald Schools represent an important chapter in the education of African-American youths during the early-to-mid twentieth century. Seven Rosenwald Schools were built in Wicomico County.</p><p>The first school at this location, built around 1875, was a single story, one-room plan frame building that served the Sharptown District for over forty years. Built in 1919 to replace the first school, this two-story, hip roofed frame structure was financed creatively by several sources including Wicomico County as well as local residents who donated the land, timber and part of the labor. The lot on which the school stands was donated by community residents William L. and Mary Brown. A third source of funding was provided by Julius Rosenwald, president of the Sears, Roebuck & Co. The Julius Rosenwald Fund, administered through Booker T. Washington's Tuskegee Normal and Industrial Institute, supported the construction of new and improved schools for black children throughout the Southern states during the early twentieth century.  This school building remained in county use until 1961 when it was sold by the Board of Education. The San Domingo School is listed on the National Register of Historic Places because of its cultural and architectural importance.</p><p>The National Trust for Historic Preservation named Rosenwald Schools to its list of America's 11 Most Endangered Historic Places in 2002.</p><p>The Lower Eastern Shore Heritage Council erected a large sign documenting historical information at San Domingo </p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"WI-676","In Historic District":"no","MD Military Monuments":"","Website":"http://johnquintonfoundation.org/\nhttp://www.hmdb.org/marker.asp?marker=39835\nhttp://lowershoreheritage.org/index.php/LESHeritage/interests_article/african-amercian-heritage/","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/sanDomingo1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/sanDomingo2.jpg","Data Source":"Wicomico Co Comprehensive Plan/MD Inventory of Historic Properties","id":120,"uri":"San%20Domingo%20School","photos":["http://apps.esrgc.org/scenicbyway/img/sanDomingo1.jpg","http://apps.esrgc.org/scenicbyway/img/sanDomingo2.jpg"],"websites":["http://johnquintonfoundation.org/","http://www.hmdb.org/marker.asp?marker=39835","http://lowershoreheritage.org/index.php/LESHeritage/interests_article/african-amercian-heritage/"]},{"Name":"Schumaker Pond Park","Category":"Recreational/Hiking and Biking Trails/Public Water Access","StreetAddress1":"1019 Schumaker Pond Park","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21804","location":"38.349403, -75.569007","Description":"","DescriptionLong":"Kayaking.</p><p></p><p>Put in at Schumaker Park and paddle toward Beaverdam Creek  Schumaker Park is a beautiful, 11 acre wooded area nestled peacefully along the waterline of Schumaker Pond. The park is somehow spacious and intimate at the same time, making it perfect for either a large gathering or a quiet, casual outing. Family reunions or corporate picnics, for instance, can be easily accommodated in the large pavilion which sits up on the hill overlooking the water. An oversized grill is situated right next to the pavilion, in its own shelter, making it easy to cook on the spot for big groups. At the other end of the park is a playground with swings, slides, riding toys and a play set. Picnic tables and benches are spread throughout the well-shaded park, providing many separate areas for rest and relaxation. Down the hill from the wooded area is a narrow beach along the pond and a long dock which can be used for fishing.                    There is also an 18-hole disc golf course spread throughout Schumaker Park, affectionately called “the Schu” by regular players. The course is home to league play on Tuesday and Wednesday evenings and also to special events, such as the Schumaker Spring Shootout and Father’s Day Doubles. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicoriver.org/schumaker-pond.html\nhttp://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/schumaker-park.html","Website addl":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/schumaker-park.html","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Schumaker Pond Park 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Schumaker Pond Park 2.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Schumaker Pond Park 3.jpg","Data Source":"","id":121,"uri":"Schumaker%20Pond%20Park","photos":["http://apps.esrgc.org/scenicbyway/img/Schumaker Pond Park 1.jpg","http://apps.esrgc.org/scenicbyway/img/Schumaker Pond Park 2.jpg","http://apps.esrgc.org/scenicbyway/img/Schumaker Pond Park 3.jpg"],"websites":["http://www.wicomicoriver.org/schumaker-pond.html","http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/schumaker-park.html"]},{"Name":"Shiles Creek Public Water Access","Category":"Recreational/Public Water Access","StreetAddress1":"","City":"","County":"Wicomico","State":"MD","Zip":"","location":"38.272669, -75.812626","Description":"","DescriptionLong":"KAYAKING</p><p></p><p>Put in at the bridge on Mezick Road, paddle up or downstream from there into marshland and forested bluffs. (1 hr)You may also consider paddling from Mezick Road downstream around the point and take out in Whitehaven. (2 hrs)</p><p></p><p>Parking: Room for two cars to park on shoulder of Mezick Road or get dropped off</p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicoriver.org/shiles-creek.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":122,"uri":"Shiles%20Creek%20Public%20Water%20Access","photos":[],"websites":["http://www.wicomicoriver.org/shiles-creek.html"]},{"Name":"Shore Bank Building","Category":"Historic Site","StreetAddress1":"100 W Main Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.365322, -75.600798","Description":"","DescriptionLong":"In the 50’s was a Drug store called Central Drugs run by Irv “Doc”kamintz, then Changed to Eastern Shore Savings and Loan, then purchase by John Hanson Savings & Loan, then Shore Bank. (Henry Hannah)","DateOfSite":"1914","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/shoreBank.jpg","Data Source":"Henry Hannah","id":123,"uri":"Shore%20Bank%20Building","photos":["http://apps.esrgc.org/scenicbyway/img/shoreBank.jpg"],"websites":[]},{"Name":"Somerset County Courthouse","Category":"Historic Site","StreetAddress1":"Prince William Street","City":"Princess Anne","County":"Somerset","State":"MD","Zip":"21853","location":"38.20424, -75.693940","Description":"","DescriptionLong":"Built 1904-05, the Somerset County Courthouse was built at the site of the previous courthouse built in 1833 and the old Teackle Bank building which had been converted to county offices. An account written at the time reported that brick and other materials were salvaged from the old buildings and incorporated into the new courthouse.","DateOfSite":"1904-1905","NationalRegister":"","MD Inventory":"S-91","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"","Data Source":"MD Inventory of Historic Properties","id":124,"uri":"Somerset%20County%20Courthouse","photos":[],"websites":[]},{"Name":"St Peter’s Episcopal Church","Category":"Historic Site","StreetAddress1":"115 St. Peters Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.365913, -75.601487","Description":"St. Peter’s Church, Salisbury Parish is descended from the original Stepney Parish, established in the colony of Maryland in 1692 as part of the Church of England.  The Mother Church of Stepney Parish, Old Green Hill Church, is still standing downriver on the bank of the Wicomico River 14 miles west of here. ","DescriptionLong":"First Church</p><p>A chapel (known as Salisbury Chapel) was first built on this site in 1768, a simple brick colonial church with clear glass windows, box pews, a gallery on three sides, and a simple chancel with a wooden cross.  There has been continuous worship at this site since 1768.  Salisbury Chapel was a chapel of Stepney Parish when it was established. After American Independence, by 1791 Stepney Parish became a parish within the Diocese of Maryland, a diocese of the Protestant Episcopal Church in the U.S.  In 1827 Stepney Parish was divided and the church in Salisbury became the Chapel of Ease of Spring Hill Parish (St. Paul’s in Hebron was the main church of Spring Hill Parish).  By 1843 the church was called St. Peter’s Chapel.  Fire on August 9, 1860 destroyed the colonial church.  Few items were salvaged: 2 solid silver candlesticks, an instruction card, an ancient bookmark.  The Civil War prevented it from being rebuilt.</p><p></p><p>Second Church</p><p>Second church built by 1868. Romanesque style, with a large rose window on the west wall, three stained glass windows on the east wall.  Pews and communion rail were of walnut and the columns led the eye to a beamed ceiling.  A bell tower contained a large, deep-toned bell used to call members to services, and to serve as the town’s fire alarm.  In 1868 the General Convention approved the division of the Diocese of Maryland and the parish became part of the new Diocese of Easton.  Parsons Cemetery on North Division St. was established in 1873 from a bequest of land by parishioner Benjamin Parsons as a parish cemetery.  It continues today as the cemetery of St. Peter’s, Salisbury Parish.   Diocesan Convention established Salisbury Parish in 1879, separating it from Spring Hill Parish and declaring the boundaries of the parish to be “within the corporate limits of the town.”  The Great Fire of Salisbury, Sunday, October 18, 1886 destroyed the second church.  Only the candelabra, cross, an eagle lectern and a few holy vessels (on display in the Parish Museum) were saved.   All that remained were four roofless charred walls.</p><p></p><p>Third Church</p><p>Building the third (and present) church began soon after the fire; the first service was held on Christmas Eve 1887, and the structure was completed in 1888.   The present church was built on the same foundation as the second church.  Architect for the present church building was Thomas Burns of Philadelphia; building contractor was Slemons and Jones  The building design is Italian Romanesque (“13th Century Lombardy); the interior is a traditional basilica plan.  After the 1868 fire the bell was recast in 1888 in Baltimore and since the bell tower was not completely rebuilt, the church’s bell was installed instead in the Courthouse a block away.   Pulpit installed in 1888 as a gift from the Church of the Annunciation in Philadelphia. The Baptismal Font was installed and dedicated in 1894.  Around 1894 a storm blew out the rose window and damaged the unfinished bell tower.  Once the debt on the church was paid, on St. Peter’s Day, June 29, 1901, the Bishop of Easton, the Rt. Rev. William Forbes Adams, consecrated the building to the service of Almighty God.  In 1914 the third story and the tower belfry were completed.  In 1915 the church was redecorated to resemble how it appears today.   In  1998 the bell was moved to its present location in St. Peter’s bell tower with the stipulation that the bell was to continue to ring the hours for the city as had been done for 100 years at the Courthouse.  ","DateOfSite":"1768","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://stpeterschurch.net/about-us/history/","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/St. Peters Episcopal Church 1.JPG\nhttp://apps.esrgc.org/scenicbyway/img/St. Peters Episcopal Church 2.JPG","Data Source":"St Peter’s Episcopal Church","id":125,"uri":"St%20Peter%E2%80%99s%20Episcopal%20Church","photos":["http://apps.esrgc.org/scenicbyway/img/St. Peters Episcopal Church 1.JPG","http://apps.esrgc.org/scenicbyway/img/St. Peters Episcopal Church 2.JPG"],"websites":["http://stpeterschurch.net/about-us/history/"]},{"Name":"Sticky Fingers Biking Trail","Category":"Recreational/Hiking and Biking Trails","StreetAddress1":"","City":"","County":"Wicomico","State":"MD","Zip":"","location":"38.341414, -75.605522","Description":"","DescriptionLong":"59.9 miles of Biking trail – no additional info at this time","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicotourism.org/_assets/img/maps/Sticky_Fingers_Ride.jpg","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":126,"uri":"Sticky%20Fingers%20Biking%20Trail","photos":[],"websites":["http://www.wicomicotourism.org/_assets/img/maps/Sticky_Fingers_Ride.jpg"]},{"Name":"Sturgis One-Room School & Heritage House","Category":"Historic Site/Museum","StreetAddress1":"209 Willow Street","City":"Pocomoke","County":"Worcester","State":"MD","Zip":"21851","location":"38.075515, -75.569872","Description":"","DescriptionLong":"Sturgis One Room School Museum, formerly known as Sturgis School, is the only African American One Room School in Worcester County retaining its original integrity. It is a small structure built about 100 years ago on Brantley Road on land that was purchased by William Sturgis in 1888.</p><p></p><p>Sturgis One Room School operated as a school for 37 years. Grades 1 - 7 were taught by one teacher until it closed its doors in 1937. At that time students were transferred to Stephen Long School in the town of Pocomoke City, Maryland. For several years afterwards the school served as home for the aging William Sturgis. After the school was vacated by William Sturgis, it remained unattended and fell into a state of disrepair. In 1996, a group of interested citizens, under the leadership of the Worcester County Historical Society, purchased the school from the Sturgis family and moved it to its present location in downtown Pocomoke City, Maryland. </p><p></p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.worcestermuseums.org/sturgis-one-room-school-and-heritage-house.php","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":127,"uri":"Sturgis%20One-Room%20School%20%26%20Heritage%20House","photos":[],"websites":["http://www.worcestermuseums.org/sturgis-one-room-school-and-heritage-house.php"]},{"Name":"Teackle Mansion","Category":"Historic Site/Heritage Tourism/Maryland Historic Trust","StreetAddress1":"Mansion Street","City":"Princess Anne","County":"Somerset","State":"MD","Zip":"21853","location":" 38.203412, -75.696465","Description":"","DescriptionLong":"The Teackle Mansion is the 200 year old former residence of Littleton Dennis Teackle and Elizabeth Upshur Teackle. The neo-classical, 10,000 square foot American villa style house exhibits a grandiose plan that included formal spaces with decorative plaster finishes, an indoor bath, steam operated kitchen equipment (then unheard of modern conveniences in their day), and a wide range of elaborate furnishings.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://somersetcountyhistoricalsociety.org/teackle_mansion","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Teackle Mansion.jpg","Data Source":"","id":128,"uri":"Teackle%20Mansion","photos":["http://apps.esrgc.org/scenicbyway/img/Teackle Mansion.jpg"],"websites":["http://somersetcountyhistoricalsociety.org/teackle_mansion"]},{"Name":"Thomas H. Williams Building","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"113 1/2 Main Street","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.365551, -75.601279","Description":"","DescriptionLong":"Thomas H. Williams is credited with financing the construction of this building following the 1886 fire. By 1888, the building included a tailor shop. The property remained in Williams family hands untis 1913, when the property was acquired by jeweler Guy M. Fisher. The building is listed in the Maryland Inventory of Historic Properties (No. WI-272).","DateOfSite":"1887","NationalRegister":"","MD Inventory":"WI-272","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Thomas H Williams Bldg 1.jpg","Data Source":"MD Inventory of Historic Properties","id":129,"uri":"Thomas%20H.%20Williams%20Building","photos":["http://apps.esrgc.org/scenicbyway/img/Thomas H Williams Bldg 1.jpg"],"websites":[]},{"Name":"Transpeninsular Line Marker","Category":"Historic Marker/Historic Site","StreetAddress1":"Delmar DE and Delmar MD State Line Road at intersection of Rt 13","City":"Delmar","County":"Wicomico","State":"MD","Zip":"21875","location":"38.455438, -75.558539","Description":"","DescriptionLong":"Transpeninsular line between Maryland and the lower 3 counties of Pennsylvania now Delaware. Marker directs to the Mason Dixon Marker and covered site. Agreed upon in 1760 and finally ratified 1769 by King George III thus ending almost a century of controversy between the 2 proprietors of the 2 provinces.  ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"Maryland Historic Trust and Maryland State Highway Adm Marker","Photo":"http://apps.esrgc.org/scenicbyway/img/transpeninsularLine.jpg","Data Source":"","id":130,"uri":"Transpeninsular%20Line%20Marker","photos":["http://apps.esrgc.org/scenicbyway/img/transpeninsularLine.jpg"],"websites":[]},{"Name":"Tyaskin Park and Public Water Access","Category":"Recreational/Public Water Access","StreetAddress1":"4778 Tyaskin Road","City":"Tyaskin","County":"Wicomico","State":"MD","Zip":"21865","location":"38.32726, -75.8754159","Description":"","DescriptionLong":"•  Boating - Non-Motorized Access</p><p>•  Kayak/Canoe Put-In</p><p></p><p>2 acres Tyaskin Park is one of those hidden treasures in Wicomico County that will quickly become a favorite spot to anyone who discovers it. The park is about 15 miles from Salisbury, tucked away at the end of Tyaskin Road on the Nanticoke River. A popular spot for local residents, the park has a picnic pavilion at the water’s edge, a small beach area which provides water access, and a large pier perfect for fishing or crabbing.     Visitors are able to enjoy the park today thanks to the generosity of Tyaskin residents Mattie Culver and Earnest Larmore. The couple gave the property to the county in 1942, wishing to share the beauty and tranquility of their land with others. Today, nearly 70 years later, these characteristics remain the defining features of Tyaskin Park","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/tyaskin-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/TyaskinPark.jpg","Data Source":"","id":131,"uri":"Tyaskin%20Park%20and%20Public%20Water%20Access","photos":["http://apps.esrgc.org/scenicbyway/img/TyaskinPark.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/tyaskin-park.html"]},{"Name":"Ulman Opera House and Ulman Movie Theatre Site","Category":"Historic Site","StreetAddress1":"234 West Main Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":" 38.365172, -75.602781","Description":"The vacant lot on the south side of West Main Street near Market Street is the site of the former Ulman Opera House, built in 1887 after the 1886 fire, and the Ulman Movie Theatre.","DescriptionLong":"Isaac and Simon Ulman settled in Salisbury in 1868 and established several businesses. They built a liquor and grocery store on Market Street (then known as Dock Street) which was consumed by the 1886 fire. In 1887 they purchased property on the south side of West Main Street not far from the site of their liquor and grocery store and built the Ulman Opera House. The opera house occupied the second floor, and they operated two stores on the first floor. During its time the theatre provided stage entertainment including road theatre shows, minstrel shows, community programs and events as well as an annual Christmas dance.   </p><p></p><p>The Opera House and first floor burned in a fire in 1941 and were replaced with the Ulman Movie Theatre, which opened March 2, 1942. The movie theatre occupied the first floor and had two balconeys.   The theatre burned December 30, 1963, after which the property remained an empty lot.","DateOfSite":"1887, 1942","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/ulmanOperaHouse1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/ulmanOperaHouse2.jpg\nhttp://apps.esrgc.org/scenicbyway/img/ulmanOperaHouse3.jpg","Data Source":"The Salisbury Times, “Ulman Theater Opening Without Ceremony,” page 3, Mar. 2, 1942\nThe Salisbury Times, “Theatre Fire Help Is Lauded,” page 13, Jan. 8, 1964\nThe Daily Times, “Ulman Brothers Started earlier Day Dynasty Here,” page 108, June 10, 1967\n","id":132,"uri":"Ulman%20Opera%20House%20and%20Ulman%20Movie%20Theatre%20Site","photos":["http://apps.esrgc.org/scenicbyway/img/ulmanOperaHouse1.jpg","http://apps.esrgc.org/scenicbyway/img/ulmanOperaHouse2.jpg","http://apps.esrgc.org/scenicbyway/img/ulmanOperaHouse3.jpg"],"websites":[]},{"Name":"Union Station","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"Elizabeth Street & Railroad Avenue","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21804","location":"38.371355, -75.592701","Description":"","DescriptionLong":"Salisbury's Union Station is architecturally significant for its embodiment of the characteristics of the Colonial Revival style. Built in 1913-14 near the junction where the New York, Philadelphia & Norfolk Railroad intersected with the Baltimore, Chesapeake and Atlantic Railroad, this Colonial Revival building stands out as the most elaborate passenger facility to survive on the Eastern Shore of Maryland. Superbly crafted of Flemish bond brick walls with glazed header accents and trimmed with stone-like terra cotta cornices, corner quoins, keystones, and window sills, Union Station is dramatically emblematic of the early-20th century resurgence of neoclassicism following the World Columbian Exposition held in Chicago in 1893. The new wave of neoclassicism included reinterpretations of colonial American designs and construction practices that contrasted sharply with the eclecticism and romanticism of Victorian aesthetics that had dominated American architectural designs since the third quarter of the 19th century.  Union Station is also historically significant for its association with the development of railroad transportation on the Eastern Shore. Due to its location and elaborate construction, Union Station is one of the major transportation landmarks of railroad history on the Eastern Shore, built during the period when the peninsular rail system had achieved its full maturity and influence for the region. Important as well is the aspect of cooperation and coordination inherent in the construction of Union Station by two independent railroad companies for the common good of the public traveling. Converted from a passenger station into a freight facility around 1958, the building was sold by Consolidated Railroads of Pennsylvania in 1986, and it has been used for other commercial purposes since then. The main block is 1 1/2-stories, five bays by two. The Flemish bond is highlighted by a glazed header checkerboard pattern. At the foundation level there is a cut granite stone base to the Flemish bond brick watertable accented with a cut stone-like cap executed in molded terra cotta or perhaps concrete. The surfaces of all the stone-like accents have decorative ridging that imitates tool marks as if the material was truly cut stone.","DateOfSite":"1913-14","NationalRegister":"2007","MD Inventory":"WI-150","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/unionStation.jpg","Data Source":"National Register","id":133,"uri":"Union%20Station","photos":["http://apps.esrgc.org/scenicbyway/img/unionStation.jpg"],"websites":[]},{"Name":"University of Maryland Eastern Shore (Princess Anne Academy)","Category":"Historic Site","StreetAddress1":"Backbone Road","City":"Princess Anne","County":"Somerset","State":"MD","Zip":"21853","location":"38.20777, -75.686192","Description":"","DescriptionLong":"UMES was founded in 1886 as a school for African Americans, under the auspices of the Delaware Conference of the Methodist Episcopal Church and the Centenary Biblical Institute of Baltimore. In 1890, the school was designated the Eastern Branch of the Maryland Agricultural College. The institution, popularly known as Princess Anne Academy, continued as a private school until 1926, when the state purchased the college outright. The school was under the administrative control of Morgan State College until 1936, when the administrative control was transferred to the Board of Regents of the University of Maryland.","DateOfSite":"founded 1886","NationalRegister":"","MD Inventory":"A-116","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"","Data Source":"MD Inventory of Historic Properties","id":134,"uri":"University%20of%20Maryland%20Eastern%20Shore%20(Princess%20Anne%20Academy)","photos":[],"websites":[]},{"Name":"Upper Ferry","Category":"Historic Site/Points of Interest","StreetAddress1":"Route 349","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21802","location":"38.340953, -75.695452","Description":"","DescriptionLong":"Upper Ferry, a smaller two-car ferry used currently by hundreds of area residents. Connecting from Riverside Drive area crossing the Wicomico River to Route 349 and Pemberton Hall area. This ferry is one of the few flatboat ferries operating on the Eastern Shore. Wicomico County operates two ferries that carry autos and passengers across the river. Both the Upper and Whitehaven ferries are open to serve the public.","DateOfSite":"","NationalRegister":"","MD Inventory":"WI-79","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/upperFerry.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Upper Ferry 2.jpg","Data Source":"MD Inventory of Historic Properties","id":135,"uri":"Upper%20Ferry","photos":["http://apps.esrgc.org/scenicbyway/img/upperFerry.jpg","http://apps.esrgc.org/scenicbyway/img/Upper Ferry 2.jpg"],"websites":[]},{"Name":"Vernon Powell Building","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"218-220 Main Street","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.365181, -75.602454","Description":"","DescriptionLong":"Now known as the Vernon Powell Building, the building was constructed about 1936 or 1937 and occupied by Montgomery Ward Co. The Powell family acquired the building in 1972 and moved their shoe business to this location.  The building replaced a 2-story brick residence and business of the prominent Smith dentist family; that structure was built following the 1886 fire, replacing an earlier frame structure owned and occupied by Salisbury's first dentist. The Vernon Powell building is listed in the Maryland Inventory of Historic Properties (No. WI-259).","DateOfSite":"c.1936-37","NationalRegister":"","MD Inventory":"WI-259","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"","Data Source":"MD Inventory of Historic Properties","id":136,"uri":"Vernon%20Powell%20Building","photos":[],"websites":[]},{"Name":"Victor Lynn Line Site","Category":"Historic Site","StreetAddress1":"Riverside Drive","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.363736, -75.605417","Description":"","DescriptionLong":"This site, on the south side of the Wicomico River, was home to the wharf of the Victor Lynn Line of boats which began in Salisbury in 1921 with the first boat called the \"Victor Lynn,\" a small oil burning freighter named after the first son of the company's founder Alwyn Wootten. It was replaced with a larger steamer with the same name. Additional ships were added to the fleet. The last freight service was in 1954 and the business sold in 1959.  A detailed description is available online by Wootten's grandson at http://astral.tripod.com/vlynn.html. A model of the Victor Lynn is on display at the Marina on the other side of the river.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://astral.tripod.com/vlynn.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Victor Lynn Line Site 1.jpg","Data Source":"","id":137,"uri":"Victor%20Lynn%20Line%20Site","photos":["http://apps.esrgc.org/scenicbyway/img/Victor Lynn Line Site 1.jpg"],"websites":["http://astral.tripod.com/vlynn.html"]},{"Name":"W.H. Jackson Livery Stable (Palace Stables) Site","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"Market Street","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.36474, -75.602944","Description":"","DescriptionLong":"The parking lot on the east side of Market Street between Main and Camden Streets is the site of the W.H. Jackson Livery Stable, also referred to as the Palace Livery. A 2-story brick livery was built in 1888, following the 1886 fire. William H. Jackson financed the construction. It included a mechanical lift for storing carriages on the second floor. With the introduction of the automobile, the building was adapted to a variety of commercial uses. The front of the building was adorned with the 1888 displayed in brick as well as a distinctive iron horse head. James E. Lowe operated the livery, known as the Palace Stables, until his death in 1928.  After Lowe's death, the business was operated with several partnerships, including Capt. Ike White and Ray Kent.  The building was torn down in the late 1970s. ","DateOfSite":"1888","NationalRegister":"","MD Inventory":"WI-78","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/W.H. Jackson Livery Palace Stables Site 1.jpg","Data Source":"MD Inventory of Historic Properties; Daily Times June 10, 1967 Centennial Edition","id":138,"uri":"W.H.%20Jackson%20Livery%20Stable%20(Palace%20Stables)%20Site","photos":["http://apps.esrgc.org/scenicbyway/img/W.H. Jackson Livery Palace Stables Site 1.jpg"],"websites":[]},{"Name":"Ward Museum of Wildfowl Art","Category":"Points of Interest/Heritage Tourism/Museum","StreetAddress1":"909 South Schumaker Drive","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21804","location":"38.351483, -75.571576","Description":"","DescriptionLong":"The Ward Museum is dedicated to exhibiting, collecting and promoting wildfowl art and related materials, and interpreting their significance through educational programs and publications.</p><p>The Ward Museum of Wildfowl Art, Salisbury University strives to lead the way for advancing the understanding of wildfowl art and the interrelationships of art, nature and culture. Through educational programs, exhibits and events the Ward Museum builds upon the legacy of Lem and Steve Ward in order to bring young and old to a greater understanding of the human relationship to the natural world.   The Ward Museum is a premier educational facility for the study of material culture, living traditions, and environmental concerns for the school children, scholars, and artists who are a part of the community the museum serves. \"A good museum attracts, entertains, arouses curiosity, leads questioning and thus promotes learning.\"  This is a wonderful art museum not to be missed. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wardmuseum.org/","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Ward Museum 1.JPG","Data Source":"","id":139,"uri":"Ward%20Museum%20of%20Wildfowl%20Art","photos":["http://apps.esrgc.org/scenicbyway/img/Ward Museum 1.JPG"],"websites":["http://www.wardmuseum.org/"]},{"Name":"Washington Hotel","Category":"Historic Site","StreetAddress1":"Somerset Avenue","City":"Princess Anne","County":"Somerset","State":"MD","Zip":"21853","location":"38.20472, -75.693802","Description":"","DescriptionLong":"This structure has long been known as the Washington Hotel. Long-standing traditions in Princess Anne have held that an ordinary or a tavern has operated at this location since the earliest years of town history. It appears that a tavern was operating by 1780 under a lease to Zadock Long, who purchased the lot with improvements in June of 1797. Zadock financed the construction of the northern portion of the current structure shortly after he purchased the lot from John Done. Zadock Long owned the tavern until his death in 1838 when the property passed to his son, Edward H.C. Long who re-worked part of the structure. The property was transferred in 1856 to Henry E.L. Morris and his wife, who were the first to name the hotel after George Washington. In 1869 the property was purchased by William P. Rider. The Murphy family purchased the property in 1956. The building is listed in the Maryland Inventory of Historic Properties.","DateOfSite":"1797, 1838","NationalRegister":"","MD Inventory":"S-18","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"","Data Source":"MD Inventory of Historic Properties","id":140,"uri":"Washington%20Hotel","photos":[],"websites":[]},{"Name":"Webster's Cove Boat Ramp","Category":"Recreational/Public Water Access","StreetAddress1":"Lower Wicomico River","City":"","County":"Wicomico","State":"MD","Zip":"","location":"38.247963, -75.830196","Description":"","DescriptionLong":"","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicoriver.org/access.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":141,"uri":"Webster's%20Cove%20Boat%20Ramp","photos":[],"websites":["http://www.wicomicoriver.org/access.html"]},{"Name":"Westside Community Center","Category":"Recreational","StreetAddress1":"21109 Bivalve Lodge Road","City":"Bivalve","County":"Wicomico","State":"MD","Zip":"21814","location":"38.303503, -75.8838849","Description":"","DescriptionLong":"(3.0 acres park) The Westside Community Center is located in the town of Bivalve, about 15 miles from Salisbury via Nanticoke Road. Truly a “home away from home” for many local children, the Center was built in 1959 by the Westside Lion’s Club and has been owned by Wicomico County since the 1980’s. Inside is a full-size, newly air-conditioned gym with a basketball court, climbing wall, stage, computer lab, and restroom facilities. Outside is a low ropes course, a multi-purpose field, picnic tables, and a garden area. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/westside-community-center.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Westside Community Center 1.jpg\nhttp://apps.esrgc.org/scenicbyway/img/Westside Community Center 2.jpg","Data Source":"","id":142,"uri":"Westside%20Community%20Center","photos":["http://apps.esrgc.org/scenicbyway/img/Westside Community Center 1.jpg","http://apps.esrgc.org/scenicbyway/img/Westside Community Center 2.jpg"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/westside-community-center.html"]},{"Name":"Westside Historical Society","Category":"Museum","StreetAddress1":"P.O. Box 194","City":"Mardela Springs","County":"Wicomico","State":"MD","Zip":"21837","location":"38.462643, -75.750736","Description":"","DescriptionLong":"Formed in 1985 by citizens of the western part of Wicomico County in an effort to preserve the historical knowledge, artifacts and material culture of the area, The focus of historical interest is on Wicomico County and the area around the Nanticoke River, originally identified as the voting district of “Barren Creek .” Presently it encompasses the towns of Mardela Springs, Athol, Riverton, San Domingo, Sharptown, and by extension, Vienna, Hebron and Quantico.          The organization manages tours of  the 1842 Barren Creek Springs Church and Barren Creek Museum.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://barrencreekheritage.org/index.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/westsideHistorical.jpg","Data Source":"West Side Website","id":143,"uri":"Westside%20Historical%20Society","photos":["http://apps.esrgc.org/scenicbyway/img/westsideHistorical.jpg"],"websites":["http://barrencreekheritage.org/index.html"]},{"Name":"Wetipquin Methodist Episcopal Church (Wetipquin Chapel)","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"Wetipquin Road","City":"Wetipquin","County":"Wicomico","State":"MD","Zip":"21856","location":"38.338202, -75.848962","Description":"","DescriptionLong":"Sometimes referred to during the 19th century as \"Mezick's Church or Meeting House,\" the structure is reported to have been erected between 1825 and 1827. The land was donated to the Methodist congregation by the Mezick family who had occupied land in the vicinity since the late 18th century. The structure has been remodeled around around 1877 and in 1901. ","DateOfSite":"1825-27","NationalRegister":"","MD Inventory":"WI-90","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Wetipquin Methodist Episcopal Church 1.jpg","Data Source":"MD Inventory of Historic Properties","id":144,"uri":"Wetipquin%20Methodist%20Episcopal%20Church%20(Wetipquin%20Chapel)","photos":["http://apps.esrgc.org/scenicbyway/img/Wetipquin Methodist Episcopal Church 1.jpg"],"websites":[]},{"Name":"Wetipquin Park and Public Water Access","Category":"Recreational/Public Water Access","StreetAddress1":"Wetipquin Road","City":"Tyaskin","County":"Wicomico","State":"MD","Zip":"21865","location":"38.33458480000001, -75.8603812 ","Description":"","DescriptionLong":"•  Boating - Motorized Access</p><p>•  Boating - Non-Motorized Access</p><p>•  Kayak/Canoe Put-In</p><p></p><p>2.7 acres. Wetipquin Park is located on Wetipquin Road in Tyaskin, about 20 minutes from Salisbury. Situated along Wetipquin Creek, just next to the bridge, the park provides visitors with a boat ramp and fishing area. Wetipquin is well known as a great spot to launch kayaks or canoes. Paddlers can go under the bridge and explore either Tyaskin Creek (to the right) or Wetipquin Creek (to the left). Following the creek away from the bridge will lead boaters and paddlers to its junction with the Nanticoke River</p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/wetipquin-park.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/","Data Source":"","id":145,"uri":"Wetipquin%20Park%20and%20Public%20Water%20Access","photos":["http://apps.esrgc.org/scenicbyway/img/"],"websites":["http://www.wicomicorecandparks.org/parks-and-facilities/water-access-and-launch-sites/wetipquin-park.html"]},{"Name":"White & Leonard Building","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"Main and St. Peters Streets","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.365562, -75.601450","Description":"","DescriptionLong":"The White & Leonard Building is historically identified as the Joseph Bergen commercial block, named for Bergen who acquired the property in the months following the 1886 fire and built the structure. By 1888, the building was occupied by a drugstore and a jewelry store on the first floor. The property changed hands until 1911 when it was acquired by E. Riall White, establishing the long-term location of the White & Leonard office supply business. The building is listed in the Maryland Inventory of Historic Properties (No. WI-261).","DateOfSite":"1887","NationalRegister":"","MD Inventory":"WI-261","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/White and Leonard Bldg 1.jpg","Data Source":"MD Inventory of Historic Properties","id":146,"uri":"White%20%26%20Leonard%20Building","photos":["http://apps.esrgc.org/scenicbyway/img/White and Leonard Bldg 1.jpg"],"websites":[]},{"Name":"Whitehaven Ferry","Category":"Historic Site/Points of Interest","StreetAddress1":"Route 352","City":"Whitehaven","County":"Wicomico","State":"MD","Zip":"21802","location":"38.266284, -75.787974","Description":"","DescriptionLong":"Oldest continuous running ferry in the United States. Began operation in 1688. Handles 3 cars. Travels across the Wicomico River to/from historic village of Whitehaven. Maintained by Wicomico Co Public Works and is free of charge since the ferry first began. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicocounty.org/301/Ferry-Schedule","Website addl":"http://www.wicomicocounty.org/301/Ferry-Schedule","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/whitehavenFerry.jpg","Data Source":"","id":147,"uri":"Whitehaven%20Ferry","photos":["http://apps.esrgc.org/scenicbyway/img/whitehavenFerry.jpg"],"websites":["http://www.wicomicocounty.org/301/Ferry-Schedule"]},{"Name":"Whitehaven Hotel","Category":"Historic Site","StreetAddress1":"Whitehaven Road","City":"Whitehaven","County":"Wicomico","State":"MD","Zip":"21802","location":"38.269219, -75.788967","Description":"","DescriptionLong":"The beautifully restored Whitehaven Hotel was built in several stages, the center core of the hotel is a Federal side hall/parlor dwelling, erected around 1810-15. The exterior was reworked when a large hotel addition was attached to the west gable end and a mansard roof replaced the previous gable roof. Extending to the east side of the Federal house is a turn of the 20th century frame addition. The hotel served commerce from the many steamboats plying the Wicomico River in the late 19th and early 20th century stopping at the village wharf. The hotel served commercial travelers and the general public.","DateOfSite":"c.1810-15, 1883","NationalRegister":"WI-103","MD Inventory":"WI-103","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Whitehaven Hotel 2.JPG","Data Source":"","id":148,"uri":"Whitehaven%20Hotel","photos":["http://apps.esrgc.org/scenicbyway/img/Whitehaven Hotel 2.JPG"],"websites":[]},{"Name":"Whitehaven Schoolhouse","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"Church Street","City":"Whitehaven","County":"Wicomico","State":"MD","Zip":"21802","location":"38.270275, -75.791231","Description":"","DescriptionLong":"The Whitehaven Schoolhouse is significant within the area of education because of its 50 years of service to the children of village residents from its opening as a grammar school around 1896 until its closure in 1935. The school continued to be used as the Sunday School room of the Whitehaven United Methodist Church, and as an educational and social center. ","DateOfSite":"c.1896","NationalRegister":"","MD Inventory":"WI-155","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Whitehaven Schoolhouse 1.jpg","Data Source":"","id":149,"uri":"Whitehaven%20Schoolhouse","photos":["http://apps.esrgc.org/scenicbyway/img/Whitehaven Schoolhouse 1.jpg"],"websites":[]},{"Name":"Wicomico County Historic Courthouse","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"Corner of Division & Main St","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.36576507634026,-75.59996008872986","Description":"","DescriptionLong":"The Wicomico County courthouse was built in 1878, following the 1867 creation of Wicomico County, over the razed historic tavern Byrd Tavern, one of few structures that survived great fire of 1886. Soon after the courthouse was built it was here that Fredrick Douglas spoke*  The building of American Gothic design, consists of courthouse and jail cells. No longer an active jail, the Court House still actively houses Clerk of the Court and other offices.  It is 3 stories tall with a clock tower. The 1936 addition at the rear of the original courthouse expanded the courthouse and added a top floor jail. A rear annex was added in the 1990s, further expanding the courthouse.   ","DateOfSite":"1878, 1936","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"https://aahistorydelmarva.wordpress.com/2013/12/02/salisburys-slave-pens/","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Old Courthouse 1.JPG\nhttp://apps.esrgc.org/scenicbyway/img/Old Courthouse 2.JPG\nhttp://apps.esrgc.org/scenicbyway/img/Old Courthouse 3.JPG","Data Source":"","id":150,"uri":"Wicomico%20County%20Historic%20Courthouse","photos":["http://apps.esrgc.org/scenicbyway/img/Old Courthouse 1.JPG","http://apps.esrgc.org/scenicbyway/img/Old Courthouse 2.JPG","http://apps.esrgc.org/scenicbyway/img/Old Courthouse 3.JPG"],"websites":["https://aahistorydelmarva.wordpress.com/2013/12/02/salisburys-slave-pens/"]},{"Name":"Wicomico Creek Public Water Access","Category":"Recreational/Public Water Access","StreetAddress1":"","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"","location":"38.283565, -75.688961","Description":"","DescriptionLong":" KAYAKING</p><p></p><p>This is a 2 car paddle, leave car at the shoulder of Allen Rd. Park second car at the Wicomico Yacht Club. Put in at yacht club and take a long paddle upstream through predominantly farmland mixed with hardwood forrest to Allen Rd. Pay attention to tide, make sure to start paddling as the tide turns from low-high (4-5 hrs).</p><p></p><p>Parking: Wicomico Yacht Club, Allen Rd</p><p>","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicoriver.org/wicomico-creek.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":151,"uri":"Wicomico%20Creek%20Public%20Water%20Access","photos":[],"websites":["http://www.wicomicoriver.org/wicomico-creek.html"]},{"Name":"Wicomico Hotel","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"Main and Division Streets","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.365318, -75.600493","Description":"","DescriptionLong":"Erected in 1923, the old Wicomico Hotel is the tallest building and one of the most distinctive structures of the downtown business district. The land for the hotel was partitioned from the old Wailes homestead known as \"Lakeside\" which remained standing until the mid 1950s. An early proposal was for a 4-story building, but the plans changed to a 7-story structure. The building is listed in the Maryland Inventory of Historic Properties (No. WI-270).","DateOfSite":"1923","NationalRegister":"","MD Inventory":"WI-270","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Wicomico Hotel 1.JPG","Data Source":"MD Inventory of Historic Properties","id":152,"uri":"Wicomico%20Hotel","photos":["http://apps.esrgc.org/scenicbyway/img/Wicomico Hotel 1.JPG"],"websites":[]},{"Name":"Wicomico News Building","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"110 Main Street","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.365305, -75.601216","Description":"","DescriptionLong":"The old Wicomico News Building was constructed in 1920 in the Renaissance Revival style as part of an effort to redesign and enlarge an early 20th century law office.  The building that was redesigned and enlarged was then known as the Woodcock & Webb building, for Amos W.W. Woodcock and Frederick W.C. Webb. The property had been bought by the News Publishing Company of Salisbury after the acquisition of the Brewington Bros. Co. which had published the Wicomico News since 1887. The building is listed in the Maryland Inventory of Historic Properties (No. WI-271).","DateOfSite":"1920","NationalRegister":"","MD Inventory":"WI-271","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Wicomico News Bldg 1.jpg","Data Source":"MD Inventory of Historic Properties","id":153,"uri":"Wicomico%20News%20Building","photos":["http://apps.esrgc.org/scenicbyway/img/Wicomico News Bldg 1.jpg"],"websites":[]},{"Name":"Wicomico Presbyterian Church","Category":"Historic Site","StreetAddress1":"207 Broad Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.367383333333336, -75.59911666666666","Description":"","DescriptionLong":"On March 12, 1672, Somerset County granted Presbyterians permission to conduct regular services on the Wicomico River. The first church located six miles downriver, was one of five churches organized by Francis Mackemie in 1683. It moved to Rockawalkin, 1742, and to Salisbury, 1830. Present sanctuary built 1859.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.historicalmarkerproject.com/markers/HM1YO_wicomico-presbyterian-church_Salisbury-MD.html","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Wicomico Presbyterian Church 1.JPG\nhttp://apps.esrgc.org/scenicbyway/img/Wicomico Presbyterian Church 2.JPG","Data Source":"","id":154,"uri":"Wicomico%20Presbyterian%20Church","photos":["http://apps.esrgc.org/scenicbyway/img/Wicomico Presbyterian Church 1.JPG","http://apps.esrgc.org/scenicbyway/img/Wicomico Presbyterian Church 2.JPG"],"websites":["http://www.historicalmarkerproject.com/markers/HM1YO_wicomico-presbyterian-church_Salisbury-MD.html"]},{"Name":"Wicomico Public Library","Category":"Heritage Tourism/Points of Interest/Historic Site","StreetAddress1":"122 S. Division Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.364158, -75.600622","Description":"","DescriptionLong":"Conveniently located in downtown Salisbury, the Wicomico Public Library offers a variety of services including checking out of books, videos, music, art, computer access at no charge, meeting room space to rent and a community meeting location Phone 410-749-3612.  The library is also the historic site of the Maryland National Guard Armory built 1913-15.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicolibrary.org/","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":155,"uri":"Wicomico%20Public%20Library","photos":[],"websites":["http://www.wicomicolibrary.org/"]},{"Name":"Wicomico River Greenway","Category":"Recreational","StreetAddress1":"","City":"","County":"Wicomico","State":"MD","Zip":"","location":"","Description":"","DescriptionLong":"The Wicomico River Greenway is an existing wildlife corridor along the Wicomico River. Tidal wetlands surround much of the river, although a large stretch (White Haven to Salisbury) has been heavily developed in past years. The river still provides a major waterfowl corridor, and nearly 3,000 acres of land are protected at Pemberton Historical Park at the southeastern end and by Ellis Bay Wildlife Management Area at the southwest end of the corridor.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.dnr.state.md.us/greenways/wicomico.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":156,"uri":"Wicomico%20River%20Greenway","photos":[],"websites":["http://www.dnr.state.md.us/greenways/wicomico.html"]},{"Name":"Wicomico River Water Trail","Category":"Recreational","StreetAddress1":"","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"","location":"","Description":"","DescriptionLong":"The Wicomico River Water Trail which is currently in the planning stage, is a potential water trail along the north prong of the Wicomico River in the city of Salisbury.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.dnr.state.md.us/greenways/counties/wicomico.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":157,"uri":"Wicomico%20River%20Water%20Trail","photos":[],"websites":["http://www.dnr.state.md.us/greenways/counties/wicomico.html"]},{"Name":"Wicomico Yacht Club","Category":"Fuel and Pump Out Stations","StreetAddress1":"3346 Yacht Club Road","City":"Eden","County":"Wicomico","State":"MD","Zip":"21822","location":"38.28902713459431, -75.754154920578","Description":"","DescriptionLong":"Phone #: (410)-219-5248</p><p></p><p> Open 24/7, Must have Torco Oil card","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicoriver.org/access.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":158,"uri":"Wicomico%20Yacht%20Club","photos":[],"websites":["http://www.wicomicoriver.org/access.html"]},{"Name":"Wikander's Yacht Yard Boat Ramp","Category":"Recreational/Public Water Access","StreetAddress1":"Wicomico Creek 3180 Windrows Way","City":"Eden","County":"Wicomico","State":"MD","Zip":"","location":"38.281709,-75.7301948","Description":"","DescriptionLong":"","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.wicomicoriver.org/access.html","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":159,"uri":"Wikander's%20Yacht%20Yard%20Boat%20Ramp","photos":[],"websites":["http://www.wicomicoriver.org/access.html"]},{"Name":"William D. Long Building (Market Street Books)","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"146 Market Street","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.364397, -75.603290","Description":"","DescriptionLong":"The William D. Long Building, occupied by Market Street Books, stands as the sole survivor of a group of commercial buildings at this intersection of Market (previously known as Dock) Street and Camden Street, near the crossing of the old Camden Street bridge.  The lot was purchased by William D. and Virginia W. Long in 1923.  Today the building is home to Market Street Books. The building is listed in the Maryland Inventory of Historic Properties (No. WI-148).","DateOfSite":"1923","NationalRegister":"","MD Inventory":"WI-148","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/William D Long Bldg_Market St Books 1.jpg\n","Data Source":"MD Inventory of Historic Properties","id":160,"uri":"William%20D.%20Long%20Building%20(Market%20Street%20Books)","photos":["http://apps.esrgc.org/scenicbyway/img/William D Long Bldg_Market St Books 1.jpg"],"websites":[]},{"Name":"Williams Market","Category":"Heritage Tourism","StreetAddress1":"28474 Nanticoke Road","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.3704645,-75.6281367","Description":"","DescriptionLong":"Locally owned and operated for 20 years, Williams offers farm  fresh produce, extensive ourdoor garden plants, specialty foods, & gifts, as well as local events during the year","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"www.williamsmarket.com","Website addl":"","Additional Information":"","Photo":"","Data Source":"","id":161,"uri":"Williams%20Market","photos":[],"websites":["www.williamsmarket.com"]},{"Name":"Winterplace Park and Equestrian Center and Rail-Trail","Category":"Recreational/Hiking and Biking Trails","StreetAddress1":"6737 Blue Ribbon Road","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21804","location":"38.377424, -75.5145768","Description":"","DescriptionLong":"(377.8 acres park and 2.0 Mile Trail) Winterplace Park has a partially established rail-trail with areas that allow equestrian activity through large parcels of wet and forested open space east of Salisbury.","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.dnr.state.md.us/greenways/counties/wicomico.html","Website addl":"http://www.wicomicorecandparks.org/parks-and-facilities/family-recreation-parks/winterplace-park.html","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Winterplace Park and Rail-Trail 1.jpg\n","Data Source":"","id":162,"uri":"Winterplace%20Park%20and%20Equestrian%20Center%20and%20Rail-Trail","photos":["http://apps.esrgc.org/scenicbyway/img/Winterplace Park and Rail-Trail 1.jpg"],"websites":["http://www.dnr.state.md.us/greenways/counties/wicomico.html"]},{"Name":"Woolworth's Building (The Gallery Building)","Category":"Historic Site/Maryland Historical Trust","StreetAddress1":"212 Main Street","City":"Salisbury","County":"Wicomico ","State":"MD","Zip":"21801","location":"38.365202, -75.602278","Description":"","DescriptionLong":"The Gallery Building occupies the old Woolworth's Building which was dramatically remodeled around 1995. The original building was constructed around 1890-94 following the 1886 fire. By 1899, the building was occupied by a wholesale grocery, a private school, and boarding rooms. Other businesses occupied the space including a sewing machine store and clothier. But the building is best remembered as Woolworth's for many years. The building is listed in the Maryland Inventory of Historic Properties (No. WI-260).","DateOfSite":"c.1890-94","NationalRegister":"","MD Inventory":"WI-260","In Historic District":"","MD Military Monuments":"","Website":"","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Woolworth Bldg_Gallery Bldg 1.JPG\nhttp://apps.esrgc.org/scenicbyway/img/Woolworth Bldg_Gallery Bldg 2.JPG","Data Source":"MD Inventory of Historic Properties","id":163,"uri":"Woolworth's%20Building%20(The%20Gallery%20Building)","photos":["http://apps.esrgc.org/scenicbyway/img/Woolworth Bldg_Gallery Bldg 1.JPG","http://apps.esrgc.org/scenicbyway/img/Woolworth Bldg_Gallery Bldg 2.JPG"],"websites":[]},{"Name":"Wright's Market","Category":"Heritage Tourism","StreetAddress1":"9300 Old Railroad Road (County Road 430)","City":"Mardela Springs","County":"Wicomico","State":"MD ","Zip":"21837","location":"38.44904, -75.699547","Description":"","DescriptionLong":"Almost year round indoor farm market, family owned by 5 generations of the Wright family.  Offers fresh vegetables and fruits, fresh bakery items, lawn & garden & gifts. Features an outdoor pen with friendly goats. Wrights is at the corner of Route 50 and Old Railroad Road. ","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"www.wrightsmarket.com","Website addl":"","Additional Information":"","Photo":"https://www.dropbox.com/s/r47yulw0p92aro2/Wrights%20Market.jpg?raw=1","Data Source":"","id":164,"uri":"Wright's%20Market","photos":["https://www.dropbox.com/s/r47yulw0p92aro2/Wrights%20Market.jpg?raw=1"],"websites":["www.wrightsmarket.com"]},{"Name":"Wye Oak Seedling","Category":"Historic Site","StreetAddress1":"Division and Main Street","City":"Salisbury","County":"Wicomico","State":"MD","Zip":"21801","location":"38.365916666666664, -75.6004","Description":"","DescriptionLong":"A marker is in place to identify and dedicate a seedling from the original Wye Oak tree, dedicated in April 1977. *                                                                                                                     </p><p></p><p>The Wye Oak was the honorary state tree of MD and was the largest white oak in the United States. It was believed to have been over 460 years old and was located in Wye Mills, MD.  The Wye Oak  was destroyed by a severe thunderstorm in June 2002.**","DateOfSite":"","NationalRegister":"","MD Inventory":"","In Historic District":"","MD Military Monuments":"","Website":"http://www.hmdb.org/Marker.asp?Marker=3863\nhttp://en.wikipedia.org/wiki/Wye_Oak","Website addl":"","Additional Information":"","Photo":"http://apps.esrgc.org/scenicbyway/img/Wye Oak Seedling 1.JPG","Data Source":"","id":165,"uri":"Wye%20Oak%20Seedling","photos":["http://apps.esrgc.org/scenicbyway/img/Wye Oak Seedling 1.JPG"],"websites":["http://www.hmdb.org/Marker.asp?Marker=3863","http://en.wikipedia.org/wiki/Wye_Oak"]}]